import asyncio
import sqlite3
import re
from aiogram import Bot, Dispatcher, types
from aiogram.types import InlineKeyboardMarkup, InlineKeyboardButton
from aiogram.filters import Command
from datetime import datetime
import os
from aiogram import Bot, Dispatcher

print("Бот запущен")

TOKEN = "8425155912:AAFT4AIwrRphrV8g4IenxwxIL2wSRN95uKA"

from aiogram import Bot, Dispatcher

bot = Bot(token=TOKEN)
dp = Dispatcher()

db = sqlite3.connect("users.db")
cursor = db.cursor()

ADMIN_ID = 666877639

def is_admin(user_id: int) -> bool:
    return user_id == ADMIN_ID

def add_or_update_user(user):
    now = datetime.now().strftime("%Y-%m-%d %H:%M:%S")

    cursor.execute("SELECT user_id FROM users WHERE user_id = ?", (user.id,))
    exists = cursor.fetchone()

    if exists:
        cursor.execute("""
            UPDATE users
            SET last_seen = ?,
                requests_count = requests_count + 1
            WHERE user_id = ?
        """, (now, user.id))
    else:
        cursor.execute("""
            INSERT INTO users (
                user_id, username, first_name, last_name,
                first_seen, last_seen, requests_count
            )
            VALUES (?, ?, ?, ?, ?, ?, 1)
        """, (
            user.id,
            user.username,
            user.first_name,
            user.last_name,
            now,
            now
        ))

    db.commit()

def get_top_users(limit=10):
    cursor.execute("""
        SELECT user_id, requests_count
        FROM users
        ORDER BY requests_count DESC
        LIMIT ?
    """, (limit,))
    return cursor.fetchall()

def get_users_count() -> int:
    cursor.execute("SELECT COUNT(*) FROM users")
    return cursor.fetchone()[0]

db.commit()


CHANNEL_USERNAME = "@kinonawe4er"

async def send_long_text(message, text, chunk_size=3800):
    for i in range(0, len(text), chunk_size):
        await message.answer(text[i:i + chunk_size], parse_mode="HTML")

async def is_subscribed(user_id: int) -> bool:
    try:
        member = await bot.get_chat_member(CHANNEL_USERNAME, user_id)
        return member.status not in ("left", "kicked")
    except:
        return False
    
def get_all_users(limit: int = 20):
    cursor.execute("""
        SELECT user_id, username, first_name, last_name, requests_count, last_seen
        FROM users
        ORDER BY last_seen DESC
        LIMIT ?
    """, (limit,))
    return cursor.fetchall()

@dp.message(Command("top"))
async def top_users(message: types.Message):
    if not is_admin(message.from_user.id):
        return

    users = get_top_users()

    text = "🏆 <b>Топ активных пользователей</b>\n\n"
    for i, (uid, count) in enumerate(users, 1):
        text += f"{i}. <code>{uid}</code> — {count} сообщений\n"

    await message.answer(text, parse_mode="HTML")

@dp.message(Command("users"))
async def show_users(message: types.Message):
    if not is_admin(message.from_user.id):
        return
    
    users = get_all_users()

    text = "<b>👥 Все пользователи бота</b>\n\n"
    for i, (uid, username, first_name, last_name, count, last_seen) in enumerate(users, 1):
        name = f"{first_name or ''} {last_name or ''}".strip() or username or "Неизвестно"
        text += (
            f"{i}. {name} (<code>{uid}</code>)\n"
            f"   🔹 запросов: {count}\n"
            f"   🕒 последний визит: {last_seen}\n\n"
        )

    await send_long_text(message, text)

@dp.message(Command("stats"))
async def stats_cmd(message: types.Message):
    if not is_admin(message.from_user.id):
        return

    count = get_users_count()
    await message.answer(f"👥 Всего пользователей: {count}")

movies = {
    "001": {
        "title": "Фокус",
        "year": 2015,
        "video": "BAACAgIAAxkBAAPlaW_6qPFWLJET2IHTPZaLXu5DCB0AAkSFAALeEYBLdwlXzpGento4BA",
        "description": "История об опытном мошеннике, который влюбляется в девушку, делающую первые шаги на поприще нелегального отъема средств у граждан. Отношения становятся для них проблемой, когда обнаруживается, что романтика мешает их нечестному бизнесу.",
        "country": "США, Аргентина",
        "director": "Джон Рекуа",
        "genres": ["комедия", "криминал"]  
    },
    "002": {
        "title": "Люси",
        "year": 2014,
        "video": "BAACAgIAAxkBAAPjaW_6HHpdWPA6t9-Xlabee8F06ksAAkOFAALeEYBLBOSrtXXhzqk4BA",
        "description": "Еще вчера она была просто сексапильной блондинкой, а сегодня — самое опасное и смертоносное создание на планете со сверхъестественными способностями и интеллектом. То, что совсем недавно лучшие умы мира считали фантастической теорией, для нее стало реальностью. И теперь из добычи она превратится в охотницу.",
        "country": "Франция, США",
        "director": "Люк Бессон",
        "genres": ["научнаяфантастика", "боевик"]    
    },
    "003": {
        "title": "Исходный код",
        "year": 2011,
        "video": "BAACAgIAAxkBAAIBDWlwtpqJ8ei-QcwTlLse5r90HKNkAALGigAC3hGASw6AQA-_raWiOAQ",
        "description": "Солдат по имени Коултер мистическим образом оказывается в теле неизвестного мужчины, погибшего в железнодорожной катастрофе. Коултер вынужден переживать чужую смерть снова и снова до тех пор, пока не поймет, кто зачинщик катастрофы.",
        "country": "США, Канада",
        "director": "Данкан Джонс",
        "genres": ["научнаяфантастика", "триллер"]    
    },
    "005": {
        "title": "Век Адалин",
        "year": 2015,
        "video": "BAACAgIAAxkBAAIBD2lwtwXZFw01zkO6Ids2UWEGKVC2AALKigAC3hGASxVemJK6ItTOOAQ",
        "description": "Главная героиня родилась вместе с XX веком и живет на свете уже сто лет, но при этом не стареет. Несмотря на свою долгую жизнь,Адалин так и не смогла найти любимого человека. Однако наконец-то она встречает мужчину, ради которого сможет снова стать смертной и состариться вместе с ним.",
        "country": "США, Канада",
        "director": "Ли Толанд Кригер",
        "genres": ["мелодрама", "драма"]    
    },
    "006": {
        "title": "Счастливого дня смерти",
        "year": 2017,
        "video": "BAACAgIAAxkBAAIBEWlwt2e0i4mVpW7P8NMm_gkYSqQzAALMigAC3hGASwh-MMx_tMqGOAQ",
        "description": "Каждый в универе мечтал попасть на её день рождения, но праздник был безнадежно испорчен незнакомцем в маске, убившим виновницу торжества. Однако судьба преподнесла имениннице леденящий душу подарок — бесконечный запас жизней. И теперь у девушки появился шанс вычислить своего убийцу, ведь этот день будет повторяться снова и снова…",
        "country": "США",
        "director": "Режиссер: Кристофер Лэндон",
        "genres": ["ужасы", "детектив"]    
    },
    "008": {
        "title": "Экзамен",
        "year": 2009,
        "video": "BAACAgIAAxkBAAIBF2lwuUJufdOBy45v6czalZP3SnY7AALhigAC3hGAS5xmXrpn7-FQOAQ",
        "description": "На пути к заветной должности они уже преодолели массу испытаний, но им осталось пройти последний экзамен. Он проводится в изолированной комнате под присмотром камер и молчаливого вооружённого охранника. Суровый «Наблюдатель» оглашает задание: чтобы получить «работу мечты», нужно за отведённые 80 минут ответить «на один единственный вопрос»",
        "country": "Великобритания",
        "director": "Стюарт Хэзелдайн",
        "genres": ["триллер"]    
    },
    "009": {
        "title": "Довод",
        "year": 2020,
        "video": "BAACAgIAAxkBAAIBFWlwuKVUdobM-SCARNvJGE6tEl05AALaigAC3hGAS6w_KUC_dANAOAQ",
        "description": "Главный герой — секретный агент, который проходит жестокий тест на надежность и присоединяется к невероятной миссии. От ее выполнения зависит судьба мира, а для успеха необходимо отбросить все прежние представления о пространстве и времени",
        "country": "США, Великобритания",
        "director": "Кристофер Нолан",
        "genres": ["боевик", "триллер", "научнаяфантастика"]    
    },
    "011": {
        "title": "Невиновная",
        "year": 2020,
        "video": "BAACAgIAAxkBAAIBE2lwt9c4RCbm9ctJkdxVfDYSiqD5AALUigAC3hGAS8PrdmkrDUpdOAQ",
        "description": "На поминках в Тэчхоне происходит массовое отравление со смертельным исходом, пострадал даже мэр. Главная подозреваемая — вдова покойного. Её дочь Чон-ин, преуспевающая сеульская адвокат, возвращается в родной город и берётся защищать мать, хотя та страдает деменцией и даже не узнаёт её. Многое в этом деле кажется подозрительным, расследование было проведено с нарушениями, и Чон-ин только укрепляется во мнении, что мать невиновна, а власти явно что-то скрывают.",
        "country": "Южная Корея",
        "director": "Пак Сан-хён",
        "genres": ["детектив", "драма"]    
    },
    "012": {
        "title": "Код да Винчи",
        "year": 2006,
        "video": "BAACAgIAAxkBAAIBGWlwujj4OfEb9qTGcMUHW3jUXE8FAALvigAC3hGAS3qYfsOTvW-EOAQ",
        "description": "Гарвардского профессора Роберта Лэнгдона подозревают в чудовищном преступлении, которого он не совершал. Лэнгдон знакомится с криптографом парижской полиции Софи Невё и вместе с ней пытается раскрыть тайну, которая может подорвать могущество католической церкви.",
        "country": "США, Франция",
        "director": "Рон Ховард",
        "genres": ["триллер", "детектив", "мистика"]    
    },
    "013": {
        "title": "Французская сюита",
        "year": 2014,
        "video": "BAACAgIAAxkBAAIBbWlwyExrXb7I47JyKruAjxEhFM4YAAK3iwAC3hGAS7JG39_evKQeOAQ",
        "description": "В центре романтической истории времён Второй мировой войны — молодая девушка, живущая вместе со свекровью в оккупированной фашистами Франции. Нелюбимый муж ушёл на поле боя, и героиня влюбляется в немецкого офицера. Их объединяет любовь к музыке: она играет на фортепиано, а немец — бывший композитор.",
        "country": "США, Франция, Бельгия",
        "director": "Сол Дибб",
        "genres": ["триллер", "драма", "мелодрама", "военный"]    
    },
    "014": {
        "title": "Тоннель в лето, выход прощаний",
        "year": 2022,
        "video": "BAACAgIAAxkBAAIBI2lwvn9FQlrEzkxH-EMffkFdzemrAAIoiwAC3hGAS16awpVDUAa6OAQ",
        "description": "Когда-то у школьника Каору Тоно была дружная и счастливая семья. Но после того, как его младшая сестра Карэн погибла, всё изменилось. Родители вскоре развелись, а отношения с ними у подростка разладились. \nОднажды юноша узнаёт легенду о тоннеле Урасима. Считается, что тот, кто преодолеет его, сможет исполнить любое желание, но платить придётся годами своей жизни. Каору решает проверить слухи и попытаться вернуть свою сестру. Неожиданно к нему решает присоединиться новая ученица школы Андзу Ханасиро, у которой тоже есть заветное желание.",
        "country": "Япония",
        "director": "CLAP",
        "genres": ["драма", "аниме"]    
    },
    "018": {
        "title": "Иллюзия полёта",
        "year": 2005,
        "video": "BAACAgIAAxkBAAIBIWlwvdxti8-hhuIg-Ygy-Lw7ljjmAAIiiwAC3hGAS5kckltA5NAmOAQ",
        "description": "У Кайл Пратт неожиданно бесследно пропадает 6-летняя дочь Джулия. Переживая эмоциональный стресс после кончины мужа, Кайл отчаянно пытается доказать свою вменяемость не верящим ей членам экипажа и пассажирам. Однако ситуация выглядит настолько абсурдной и фантастичной, что она уже сама начинает сомневаться в адекватности своего восприятия реальности. Ведь факты свидетельствуют о том, что Джулии вообще не было на борту самолета.",
        "country": "США",
        "director": "Роберт Швентке",
        "genres": ["триллер", "детектив", "драма"]    
    },
    "020": {
        "title": "Сводишь с ума",
        "year": 2025,
        "video": "BAACAgIAAxkBAAIBH2lwvZFC8eeMck1XZaSR7MnZh1ApAAIZiwAC3hGAS5D4o36AK7K9OAQ",
        "description": "на просмотр квартиры в старом фонде Петербурга являются сразу двое — SMM-менеджер Алиса и бармен Иван. Квартиру сдают только паре, поэтому Иван подыгрывает девушке, представляясь её мужем. Алиса делает так, что квартира достаётся ей, а Иван вынужден искать другое жильё.После этого в зеркале она видит параллельную реальность - в ней квартиру получил Иван.\nПытаясь разобраться, что происходит и ужиться в одном пространстве герои проходят весь путь от жуткой ненависти до любви",
        "country": "Россия",
        "director": "Дарья Лебедева",
        "genres": ["мелодрама", "драма", "фантастика"]    
    },
    "021": {
        "title": "Апгрейд",
        "year": 2018,
        "video": "BAACAgIAAxkBAAIBHWlwvTI3TqmeblCqGZt4Zvw2hnBVAAIRiwAC3hGAS0u9jVRF6MppOAQ",
        "description": "2046 год. Разнообразные технологии участвуют во всех аспектах человеческой жизни. Но в этом технологичном мире Грей — один из немногих людей, кто любит работать руками. Он восстанавливает и чинит старые автомобили. Однажды, возвращаясь от клиента, Грей с женой попадают в аварию, а после — в руки банды отморозков, в результате чего Грей оказывается парализованным ниже шеи. Тот самый богатый клиент предлагает несчастному поставить экспериментальный имплант Stem, который может полностью восстановить подвижность.",
        "country": "США, Австралия",
        "director": "Ли Уоннелл",
        "genres": ["научнаяфантастика", "боевик"]    
    },
    "022": {
        "title": "Три тысячи лет желаний",
        "year": 2022,
        "video": "BAACAgIAAxkBAAIBG2lwvMns4Mfp-c7eGJ79DpoByC3ZAAINiwAC3hGAS2351aqRpX30OAQ",
        "description": "Британская лингвистка Алетея прилетает из Лондона в Стамбул, чтобы прочитать курс лекций по нарративу. Уже в аэропорту женщина начинает видеть загадочных существ, а когда в одной из многочисленных сувенирных лавочек покупает стеклянную бутылочку и пытается её отмыть, перед ней возникает самый настоящий джинн. Алетея не торопится загадывать три желания, ей интереснее послушать его историю. Джинн начинает свой рассказ.",
        "country": "США, Австралия",
        "director": "Джордж Миллер",
        "genres": ["фантастика", "драма", "мелодрама"]    
    },
    "023": {
        "title": "Министерство неджентльменских дел",
        "year": 2024,
        "video": "BAACAgIAAxkBAAIBJWlwvxdCAStPaE7lNtYJ6B7RlAOYAAIziwAC3hGAS63wf7eMbpMhOAQ",
        "description": "1942 год, Великобритания. Они — лучшие из лучших. Отпетые авантюристы и первоклассные спецы, привыкшие действовать в одиночку. Но когда на кону стоит судьба всего мира, им приходится объединиться в сверхсекретное боевое подразделение и отправиться на выполнение дерзкой миссии против нацистов.",
        "country": "США, Турция, Великобритания",
        "director": "Гай Ричи",
        "genres": ["боевик", "история", "военный"]    
    },
    "024": {
        "title": "Иллюзия контроля",
        "year": 2022,
        "video": "BAACAgIAAxkBAAIBJ2lwwCBrzhgJ3W44J1xQmhApla3PAAI7iwAC3hGAS4eckd8aBDl_OAQ",
        "description": "С самого детства Виктор прекрасно манипулировал другими в собственных интересах. Со временем эта способность начинает позволять ему контролировать и направлять крупные финансовые потоки в интересах своих клиентов. Но однажды он обнаруживает, что всю свою жизнь, с самого детства, являлся марионеткой в чьей-то весьма тонко продуманной игре.",
        "country": "Великобритания, Украина",
        "director": "Владэк Занковски",
        "genres": ["триллер", "детектив", "драма"]    
    },
    "025": {
        "title": "Джентльмены",
        "year": 2019,
        "video": "BAACAgIAAxkBAAIBKWlwwLiCL45u_gZ4i1W07rxJohbuAAJGiwAC3hGAS3j8RE4RFyUvOAQ",
        "description": "Один ушлый американец ещё со студенческих лет приторговывал наркотиками, а теперь придумал схему нелегального обогащения с использованием поместий обедневшей английской аристократии и построил на этом бизнес-империю.",
        "country": "США, Великобритания",
        "director": "Гай Ричи",
        "genres": ["криминал", "комедия"]    
    },
    "026": {
        "title": "Престиж",
        "year": 2006,
        "video": "BAACAgIAAxkBAAIBL2lwwlfee5SVCbDWwotWN7jYrVSIAAJhiwAC3hGAS0pg70l5GP6XOAQ",
        "description": "Два известных фокусника, Роберт Энджер и Альфред Борден, когда-то были приятелями, но после несчастного случая, произошедшего прямо во время выступления, их сотрудничеству пришёл конец. Теперь они не просто конкуренты, а враги.\nЛучшим трюком того времени стало «перемещение человека». Энджер посылает к Бордену свою помощницу, поручив ей хитростью выманить секрет. А если этого будет мало — Энджер готов поступиться всем ради победы. ",
        "country": "США",
        "director": "Кристофер Нолан",
        "genres": ["триллер", "научнаяфантастика"]    
    },
    "027": {
        "title": "Волк с Уолл-стрит",
        "year": 2013,
        "video": "BAACAgIAAxkBAAIBK2lwwVknmnYHl0_Wj0jGRHuQVYcIAAJPiwAC3hGAS8WzI0SGI2NeOAQ",
        "description": "Захватывающая криминальная драма о жизни Джордана Белфорта, биржевого мошенника, который стремился к богатству и власти. Фильм исследует темы коррупции, алчности и разрушительного влияния финансов на общество.",
        "country": "США",
        "director": "Мартин Скорсезе",
        "genres": ["криминал", "биография", "комедия"]    
    },
    "028": {
        "title": "Загадочная история Бенджамина Баттона",
        "year": 2018,
        "video": "BAACAgIAAxkBAAIBLWlwwdrdu7206uhvaGLjWjrVWr8tAAJbiwAC3hGAS5imizCwapazOAQ",
        "description": "Фильм о мужчине, который родился в возрасте 80 лет, а затем… начал молодеть. Этот человек, как и каждый из нас, не мог остановить время. Его путь в ХХI век, берущий свое начало в Новом Орлеане в 1918 году в самом конце Первой Мировой войны, будет столь необычен, что вряд ли мог иметь место в жизни кого-либо другого.",
        "country": "США",
        "director": "Дэвид Финчер",
        "genres": ["драма", "фантастика", "мелодрама"]    
    },
    "031": {
        "title": "Аватар",
        "year": 2009,
        "video": "BAACAgIAAxkBAAIC8WlxReRiUWPRW-o-M1IXAAH2lluWeAACEIoAAt4RiEtpScX4-OB0SjgE",
        "description": "Бывший морпех Джейк Салли прикован к инвалидному креслу. Он получает задание совершить путешествие в несколько световых лет к базе землян на планете Пандора, где корпорации добывают редкий минерал, имеющий огромное значение для выхода Земли из энергетического кризиса.",
        "country": "США",
        "director": "Джеймс Кэмерон",
        "genres": ["научнаяфантастика", "боевик", "драма", "фантастика"]    
    },
    "032": {
        "title": "Аватар 2: Путь воды",
        "year": 2022,
        "video": "BAACAgIAAxkBAAIEWWlyB5S_NWYLPe_s_nI0jSTO3xzpAAKHigACk1iRSxDSHr4ka_HKOAQ",
        "description": "Джейк Салли становится предводителем народа на'ви и берет на себя миссию по защите новых друзей от корыстных бизнесменов с Земли. Теперь ему есть за кого бороться — с Джейком его прекрасная жена Нейтири. Когда на Пандору возвращаются до зубов вооруженные земляне, Джейк готов дать им отпор.",
        "country": "США",
        "director": "Джеймс Кэмерон",
        "genres": ["научнаяфантастика", "боевик", "драма", "фантастика"]    
    },
    "033": {
        "title": "Аватар 3: Пламя и пепел",
        "year": 2025,
        "video": "BAACAgIAAxkBAAILNGl7mxi83yzts9J5eekKL8Mzub8CAAJ7lAACsvXhS95QFzNqTiZqOAQ",
        "description": "Джейк Салли, Нейтири и их дети переживают смерть Нетейама. Противостояние с корпорацией RDA обостряется, и теперь семье предстоит столкнуться с враждебным племенем на’ви во главе с Варанг.",
        "country": "США",
        "director": "Джеймс Кэмерон",
        "genres": ["научнаяфантастика", "боевик", "драма", "фантастика"]    
    },
    "034": {
        "title": "Интерстеллар",
        "year": 2014,
        "video": "BAACAgIAAxkBAAIFb2lyWHEHKbUah6sHBFYmcIMFE-QTAALkTwACwM7ZSRFWLvtg09-gOAQ",
        "description": "Когда засуха, пыльные бури и вымирание растений приводят человечество к продовольственному кризису, коллектив исследователей и учёных отправляется сквозь червоточину (которая предположительно соединяет области пространства-времени через большое расстояние) в путешествие, чтобы превзойти прежние ограничения для космических путешествий человека и найти планету с подходящими для человечества условиями.",
        "country": "США",
        "director": "Кристофер Нолан",
        "genres": ["научнаяфантастика", "драма"]    
    },
    "035": {
        "title": "Бесславные ублюдки",
        "year": 2009,
        "video": "BAACAgIAAxkBAAILe2l9KGU-b6pILDM-sraqo39mj3NXAAIJmgACAynpS6lkddQlvsGQOAQ",
        "description": "Вторая мировая война.В оккупированной немцами Франции группа американских солдат-евреев наводит страх на нацистов, жестоко убивая и скальпируя солдат.",
        "country": "США, Германия",
        "director": "Квентин Тарантино",
        "genres": ["военный", "боевик", "комедия"]    
    },
    "036": {
        "title": "Люди в черном",
        "year": 1997,
        "video": "BAACAgIAAxkBAAIK32l5BdTPLB2XkPn6Pw2y1SVFVl9zAALGiwACe8zIS8nWD1b-cbq7OAQ",
        "description": "Они - самый большой секрет Земли. Они работают на неофициальное правительственное агентство, регулирующее деятельность инопланетян на Земле. Они - это лучшая, последняя и единственная линия защиты Земли от отбросов вселенной. Их работа секретна, их оружие совершенно, им нет равных, они не оставляют следов. Они - это Люди в черном.",
        "country": "США",
        "director": "Барри Зонненфельд",
        "genres": ["боевик", "комедия", "фантастика"]    
    },
    "037": {
        "title": "Люди в черном 2",
        "year": 2002,
        "video": "BAACAgIAAxkBAAIKxml5BIa9hncQGTYkHr5DbL0LqaZ4AAKkiwACe8zIS7WYrux2MOPcOAQ",
        "description": "Проходит 25 лет и на Землю прилетает уничтожительница миров Серлина. Приняв образ сексапильной фотомодели, она начала поиски «Светоча». Чтобы не дать ни единого шанса Серлине артефакт нужно отыскать раньше неё, но есть одна проблема - Кею стёрли память. Теперь Джею, для спасения мира, во чтобы то ни стало нужно найти способ восстановить его память.",
        "country": "США",
        "director": "Барри Зонненфельд",
        "genres": ["боевик", "комедия", "фантастика"]    
    },
    "038": {
        "title": "Люди в черном 3",
        "year": 2012,
        "video": "BAACAgIAAxkBAAIK4Wl5Bl9JJhjPo8orDibh3F6y2V1MAALPiwACe8zIS5aFfBFIsNzIOAQ",
        "description": "Агент Джей узнает, что никакого защитного галактического щита, способного отразить иноземный удар, не существует. Агент Кей не построил его, потому что кто-то изменил ход времени. Агент Джей должен совершить путешествие во времени, чтобы спасти Землю и жизнь напарника.",
        "country": "США",
        "director": "Барри Зонненфельд",
        "genres": ["боевик", "комедия", "фантастика"]    
    },
    "039": {
        "title": "Остров проклятых",
        "year": 2009,
        "video": "BAACAgIAAxkBAAIGwmlyrlTkfd7zopp-7CWqrT6Ihj9oAAJzkQACk1iZSw_Tcgn-HCUMOAQ",
        "description": "Два американских судебных пристава отправляются на один из островов в штате Массачусетс, чтобы расследовать исчезновение пациентки клиники для умалишенных преступников. При проведении расследования им придется столкнуться с паутиной лжи, обрушившимся ураганом и смертельным бунтом обитателей клиники.",
        "country": "США, Канада",
        "director": "Мартин Скорсезе",
        "genres": ["триллер", "драма", "детектив"]    
    },
    "040": {
        "title": "Матрица",
        "year": 1999,
        "video": "BAACAgIAAxkBAAIGxmlyr_uCNRe_FeVJK-ImAUDGdPT8AAJ3kQACk1iZS7gZE92G771nOAQ",
        "description": "Жизнь Томаса Андерсона разделена на две части: днём он — самый обычный офисный работник, получающий нагоняи от начальства, а ночью превращается в хакера по имени Нео, и нет места в сети, куда он бы не смог проникнуть. Но однажды всё меняется. Томас узнаёт ужасающую правду о реальности.",
        "country": "США",
        "director": "Вачовски",
        "genres": ["научнаяфантастика", "боевик"]    
    },
    "041": {
        "title": "1 + 1",
        "year": 2011,
        "video": "BAACAgIAAxkBAAIFdWlyWhSp44ei_zZqmqadfbIjtlbiAAIXkwACk1iRS9MvrGmTdbGCOAQ",
        "description": "Пострадав в результате несчастного случая, богатый аристократ Филипп нанимает в помощники человека, который менее всего подходит для этой работы, – молодого жителя предместья Дрисса, только что освободившегося из тюрьмы. Несмотря на то, что Филипп прикован к инвалидному креслу, Дриссу удается привнести в размеренную жизнь аристократа дух приключений.",
        "country": "Франция",
        "director": "Оливье Накаш",
        "genres": ["комедия", "драма"]    
    },
    "042": {
        "title": "Третий лишний",
        "year": 2012,
        "video": "BAACAgIAAxkBAAILfWl9KPsVoZzbsNulFR2Q9gP36kzvAAIQmgACAynpS46oYSqsv8kbOAQ",
        "description": "Джон влюблен в красавицу Лори. Он работает в прокате автомобилей и имеет большие планы на будущее. Но в их отношения вмешивается третий, давний друг Джона – Тед. Он отрывается сутки напролет, предпочитает случайные связи и не желает терять друга. Но никто на самом деле не знает на что он способен, ведь Тед – большой плюшевый медведь.",
        "country": "США",
        "director": "Сет Макфарлейн",
        "genres": ["комедия"]    
    },
    "043": {
        "title": "Всегда говори «ДА»",
        "year": 2008,
        "video": "BAACAgIAAxkBAAILeWl9JyO7TOU0dD7vnc2A9WbXjY8gAAIDmgACAynpSyNq4WNjn_RJOAQ",
        "description": "Депрессивный главный герой всегда и всем говорил «нет» — например, друзьям, если они зовут куда-то. Но в один прекрасный день он заключает соглашение, по которому всегда должен отвечать «Да» на любое предложение...",
        "country": "США, Великобритания",
        "director": "Пейтон Рид",
        "genres": ["комедия"]    
    },
    "044": {
        "title": "Время",
        "year": 2011,
        "video": "BAACAgIAAxkBAAIGvmlyrQvPXZM0YSUBSHA4AlNAGyCUAAJrkQACk1iZS4T9mpwYowABtjgE",
        "description": "Человечество перестало стареть после 25 лет, а время стало единственной валютой. Теперь богачи могут жить вечно, а простые люди, чтобы не умереть, вынуждены каждый день бороться за существование, продлевая жизненный цикл.\nРабочий из гетто Уилл Салас привык считать каждую секунду. Однажды он спасает от банды грабителей времени богатого Генри Хэмилтона и получает от него 116 лет жизни, но вскоре щедрый подарок оборачивается ловушкой.",
        "country": "США",
        "director": "Эндрю Никкол",
        "genres": ["боевик", "мелодрама", "фантастика"]    
    },
    "045": {
        "title": "Черный лебедь",
        "year": 2010,
        "video": "BAACAgIAAxkBAAIGxGlyr5TjSfFcesVc-kssb8qyWSBIAAJ2kQACk1iZS1QoDpxbNYsQOAQ",
        "description": "У примы балетного театра неожиданно появляется опасная конкурентка, способная отобрать у неё все партии. Соперничество усиливается по мере приближения ответственного выступления.",
        "country": "США",
        "director": "Даррен Аронофски",
        "genres": ["триллер", "драма", "ужасы"]    
    },
    "046": {
        "title": "Искупление",
        "year": 2007,
        "video": "BAACAgIAAxkBAAIGwGlyrcC9xRq6a28iy-iQ_0QNRVfHAAJxkQACk1iZS5PfvyzvhjCZOAQ",
        "description": "Действие фильма начинается в 1935 году и разворачивается на фоне Второй мировой войны. Талантливая тринадцатилетняя писательница Бриони Таллис бесповоротно меняет ход нескольких жизней, когда обвиняет любовника старшей сестры в преступлении.",
        "country": "Великобритания, США",
        "director": "Джо Райт",
        "genres": ["драма", "мелодрама", "детектив", "военный"]    
    },
    "047": {
        "title": "Оппенгеймер",
        "year": 2023,
        "video": "BAACAgIAAxkBAAILu2l93vwTdgSUAzcfpemfqcWmhQf0AAI3kAAC-AnoSwZXjYNNTHKlOAQ",
        "description": "История жизни американского физика-теоретика Роберта Оппенгеймера, который во времена Второй мировой войны руководил Манхэттенским проектом — секретными разработками ядерного оружия.",
        "country": "США, Великобритания",
        "director": "Кристофер Нолан",
        "genres": ["биография", "история", "драма"]    
    },
    "048": {
        "title": "Мистер и миссис Смит",
        "year": 2005,
        "video": "BAACAgIAAxkBAAILvWl931i7QGKFjT4wre57TOwVA_cUAAI-kAAC-AnoS7VZL_ws5dfJOAQ",
        "description": "Джон и Джейн женаты не так давно, но уже устали от брака. Им кажется, что они знают друг о друге всё. Но есть кое-что, что каждый предпочитает держать при себе: оба они – наёмные убийцы, которые тайно путешествуют по миру, выполняя опасные миссии. Эти отдельные тайные приключения становятся их общей судьбой в тот момент, когда Джейн получает заказ на Джона, а Джон - на Джейн.",
        "country": "США",
        "director": "Даг Лайман",
        "genres": ["триллер", "боевик", "комедия"]    
    },
    "049": {
        "title": "Дьявол носит Прада",
        "year": 2006,
        "video": "BAACAgIAAxkBAAIMC2l_hYekHykVXLY_AqgCWePt_xpJAALQkgAC-An4S7H_9qpbk91GOAQ",
        "description": "Мечтающая стать журналисткой провинциальная девушка Энди по окончании университета получает должность помощницы всесильной Миранды Пристли, деспотичного редактора одного из крупнейших нью-йоркских журналов мод. Энди всегда мечтала о такой работе, не зная, с каким нервным напряжением это будет связано…",
        "country": "США, Франция",
        "director": "Дэвид Фрэнкел",
        "genres": ["комедия", "драма"]    
    },
    "050": {
        "title": "Малефисента",
        "year": 2014,
        "video": "BAACAgIAAxkBAAIMEWl_lJEKvH9jfyhSHptQFqrUZWK-AAKukwAC-An4SytPFaxTRz81OAQ",
        "description": "Юная волшебница Малефисента вела уединенную жизнь в зачарованном лесу, окруженная сказочными существами, но однажды все изменилось… В её мир вторглись люди, которые принесли с собой разрушение и хаос, и Малефисенте пришлось встать на защиту своих подданных, призвав на помощь могущественные тёмные силы.",
        "country": "США",
        "director": "Роберт Стромберг",
        "genres": ["фантастика", "семейный", "драма"]    
    },
    "051": {
        "title": "Малефисента: Владычица тьмы",
        "year": 2019,
        "video": "BAACAgIAAxkBAAIMDWl_hlKDjWmpas7wfp26vx8fz3RUAALUkgAC-An4S1tCLgYBGyFvOAQ",
        "description": "Принцесса Аврора выросла, и теперь принц Филип делает ей предложение. Наивные молодые люди уверены, что их брак сможет объединить два королевства и помирить людей с волшебными существами, но не тут-то было. ",
        "country": "США",
        "director": "Роберт Стромберг",
        "genres": ["фантастика", "семейный", "драма"]    
    },
    "052": {
        "title": "Зеленая миля",
        "year": 1999,
        "video": "BAACAgIAAxkBAAIPzGmFxNAb8u4bNi-UvsAeGsu3N1r7AAKPkwAC24kxSJ5Dcj7iqfHUOAQ",
        "description": "Пол Эджкомб — начальник блока смертников в тюрьме «Холодная гора», каждый из узников которого однажды проходит «зеленую милю» по пути к месту казни. Пол повидал много заключённых и надзирателей за время работы. Однако гигант Джон Коффи, обвинённый в страшном преступлении, стал одним из самых необычных обитателей блока.",
        "country": "США",
        "director": "Фрэнк Дарабонт",
        "genres": ["криминал", "драма"]    
    },
    "053": {
        "title": "Мальчик в полосатой пижаме",
        "year": 2008,
        "video": "BAACAgIAAxkBAAIPzmmFxaDeBedhz4BablemVOk8vrJDAAKqkwAC24kxSKCavkqxA3IeOAQ",
        "description": "История, происходящая во время Второй мировой войны и показанная сквозь глаза невинного и ничего не подозревающего о происходящих событиях Бруно, восьмилетнего сына коменданта концентрационного лагеря. Его случайное знакомство и дружба с еврейским мальчиком по другую сторону ограды лагеря, в конечном счете, приводит к самым непредсказуемым и ошеломительным последствиям.",
        "country": "Великобритания, США",
        "director": "Марк Херман",
        "genres": ["драма", "военный"]    
    },
    "054": {
        "title": "Марсианин",
        "year": 2015,
        "video": "BAACAgIAAxkBAAIP0GmFxpVKLIVgqB6xFKNVu_JjEuESAAK3kwAC24kxSCdnUK9MOyWSOAQ",
        "description": "Марсианская миссия «Арес-3» в процессе работы вынуждена экстренно покинуть планету из-за быстро надвигающейся песчаной бури. В попытке добраться до корабля во время бури инженер и биолог Марк Уотни получает повреждение скафандра обломками антенны и команда теряет его из виду. Посчитав его погибшим, экипаж улетает. Но он жив, и в одиночку на Марсе начинает искать способы продержаться на имеющихся запасах еды, витаминов, воды и воздуха ещё 4 года до прилёта следующей миссии «Арес-4».",
        "country": "США, Великобритания",
        "director": "Ридли Скотт",
        "genres": ["фантастика", "драма", "триллер"]    
    },
    "055": {
        "title": "Отряд самоубийц",
        "year": 2016,
        "video": "BAACAgIAAxkBAAIP0mmFxsYw6TTquZZZmF6uKGlyFYE8AAK8kwAC24kxSETgkIrsgkLeOAQ",
        "description": "Правительство решает дать команде суперзлодеев шанс на искупление. Подвох в том, что их отправляют на выполнение миссии, где они, вероятнее всего, погибнут.",
        "country": "США, Канада",
        "director": "Дэвид Эйр",
        "genres": ["фантастика", "боевик"]    
    },
    "056": {
        "title": "Круэлла",
        "year": 2021,
        "video": "BAACAgIAAxkBAAIRdmmHZEm91zYTf-AGFud9J1vfnliBAAJijAACvv85SJGkn10s5EdKOgQ",
        "description": "Великобритания, 1960-е годы. Эстелла была необычным ребёнком, и особенно трудно ей было мириться со всякого рода несправедливостью. Вылетев из очередной школы, она с мамой отправляется в Лондон. Хитростью устроившись в фешенебельный универмаг, девушка привлекает внимание Баронессы, и та берёт её к себе в штат дизайнеров.",
        "country": "США, Великобритания",
        "director": "Крэйг Гиллеспи",
        "genres": ["криминал", "драма", "комедия"]    
    },
    "058": {
        "title": "Железный человек",
        "year": 2008,
        "video": "BAACAgIAAxkBAAIRIGmHUiG5zHK5MlMMaExg2e6rquLHAAKJpAACOA85SOQjRygLikoNOgQ",
        "description": "Миллиардер-изобретатель Тони Старк попадает в плен к Афганским террористам, которые пытаются заставить его создать оружие массового поражения. В тайне от своих захватчиков Старк конструирует высокотехнологичную киберброню, которая помогает ему сбежать. Однако по возвращении в США он узнаёт, что в совете директоров его фирмы плетётся заговор, чреватый страшными последствиями. Используя своё последнее изобретение, Старк пытается решить проблемы своей компании радикально...",
        "country": "США, Канада",
        "director": "Джон Фавро",
        "genres": ["фантастика", "боевик"]    
    },
    "059": {
        "title": "Невероятный халк",
        "year": 2008,
        "video": "BAACAgIAAxkBAAIRImmHUkELYx5Rmzc7AAFjUs7lS9l6fAAC4acAAjgPOUi7iR8LInyLxToE",
        "description": "История доктора Брюса Баннера, который ищет лекарство от своего необычного «заболевания», превращающего его во время эмоционального стресса в гигантского зеленого монстра Халка. Находясь в бегах от армии, стремящейся его захватить, Брюс почти находит лекарство, но все старания идут прахом, когда у Халка вдруг появляется новый, невероятно сильный противник.",
        "country": "США, Канада",
        "director": "Луи Летерье",
        "genres": ["фантастика", "боевик"]    
    },
    "060": {
        "title": "Железный человек 2",
        "year": 2010,
        "video": "BAACAgIAAxkBAAIRNmmHU_vv1LkHZbMHU-Wo22FlPNrAAALfpAACOA85SIqATVbDrakMOgQ",
        "description": "Прошло полгода с тех пор, как мир узнал, что миллиардер-изобретатель Тони Старк является обладателем уникальной кибер-брони Железного человека. Общественность требует, чтобы Старк передал технологию брони правительству США, но Тони не хочет разглашать её секреты, потому что боится, что она попадёт не в те руки. Между тем Иван Ванко — сын русского учёного, когда-то работавшего на фирму Старка, но потом уволенного и лишенного всего, намерен отомстить Тони за беды своей семьи. Для чего сооружает своё высокотехнологичное оружие.",
        "country": "США",
        "director": "Джон Фавро",
        "genres": ["фантастика", "боевик"]    
    },
    "061": {
        "title": "Тор",
        "year": 2011,
        "video": "BAACAgIAAxkBAAIROGmHVA5aX8cNoodaTIWeZZJR0F4GAAI2pgACOA85SOAMZVVPJAzYOgQ",
        "description": "Эпическое приключение происходит как на нашей планете Земля, так и в королевстве богов Асгарде. В центре истории - Могучий Тор, сильный, но высокомерный воин, чьи безрассудные поступки возрождают древнюю войну в Асгарде. Тора отправляют в ссылку на Землю, лишают сил и заставляют жить среди обычных людей в качестве наказания...",
        "country": "США",
        "director": "Кеннет Брана",
        "genres": ["фантастика", "боевик"]      
    },
    "062": {
        "title": "Первый Мститель",
        "year": 2011,
        "video": "BAACAgIAAxkBAAIRhGmHZtr86g_ulnnCVO_CZa-WnuqCAAIHjwACvv9BSHGdwhyMXUc6OgQ",
        "description": "Стив Роджерс добровольно соглашается принять участие в эксперименте, который превратит его в суперсолдата, известного как Первый мститель. Роджерс вступает в вооруженные силы США вместе с Баки Барнсом и Пегги Картер, чтобы бороться с враждебной организацией ГИДРА, которой управляет безжалостный Красный Череп.",
        "country": "США",
        "director": "Джо Джонстон",
        "genres": ["фантастика", "боевик", "военный"]    
    },
    "063": {
        "title": "Мстители",
        "year": 2012,
        "video": "BAACAgIAAxkBAAIRPGmHVEfEx9JJxFIB4F59vZK8wkG0AAKvrAACOA9BSAABjtRolwExpzoE",
        "description": "Локи возвращается, и в этот раз он не один. Земля оказывается на грани порабощения, и только лучшие из лучших могут спасти человечество. Глава международной организации Щ. И. Т. Ник Фьюри собирает выдающихся защитников справедливости и добра. Под предводительством Капитана Америки Железный Человек, Тор, Невероятный Халк, Соколиный Глаз и Чёрная Вдова вступают в войну с захватчиком.",
        "country": "США",
        "director": "Джосс Уидон",
        "genres": ["фантастика", "боевик"]    
    },
    "064": {
        "title": "Железный человек 3",
        "year": 2013,
        "video": "BAACAgIAAxkBAAIRPmmHVG-ibmlR8akTdbgG57KR3xkxAAJXpQACOA85SFa7BEPxQktxOgQ",
        "description": "Когда мир Старка рушится на его глазах по вине неизвестных противников, Тони жаждет найти виновных и свести с ними счеты. Оказавшись в безвыходной ситуации, Старк может рассчитывать только на себя и свою изобретательность, чтобы защитить тех, кто ему дорог. Это становится настоящим испытанием для героя, которому придется не только сражаться с коварным врагом, но и разобраться в себе, чтобы найти ответ на вопрос, который давно его тревожит: что важнее - человек или костюм?",
        "country": "США",
        "director": "Шейн Блэк",
        "genres": ["фантастика", "боевик"]    
    },
    "065": {
        "title": "Тор 2: Царство тьмы",
        "year": 2013,
        "video": "BAACAgIAAxkBAAIReGmHZI96rXNfhltJKpB_rsp-eskwAAJtjAACvv85SEDRMZ3teWP3OgQ",
        "description": "Могучему Тору предстоит вновь сразиться за восстановление порядка в галактике, встретившись лицом к лицу с древней инопланетной расой, ведомой злодеем Малекитом, который жаждет установить в девяти мирах власть тьмы. Столкнувшись с врагом, более могущественным, чем сам Один и всё воинство Асгарда, Тор должен собрать силы для решающей битвы.",
        "country": "США",
        "director": "Алан Тейлор",
        "genres": ["фантастика", "боевик"]    
    },
    "066": {
        "title": "Первый мститель: другая война",
        "year": 2014,
        "video": "BAACAgIAAxkBAAIRhmmHZy_rAyfiPsKZw1d56Gi7UGbVAAIKjwACvv9BSBCp7GXpvMK6OgQ",
        "description": "После беспрецедентных событий, впервые собравших вместе команду Мстителей, Стив Роджерс, известный также как Капитан Америка, оседает в Вашингтоне и пытается приспособиться к жизни в современном мире. Но покой этому герою только снится – пытаясь помочь коллеге из агентства Щ.И.Т., Стив оказывается в центре событий, грозящих катастрофой мирового масштаба.",
        "country": "США",
        "director": "Джо и Энтони Руссо",
        "genres": ["фантастика", "боевик"]    
    },
    "067": {
        "title": "Стражи галактики",
        "year": 2014,
        "video": "BAACAgIAAxkBAAIRfmmHZa-O7tiCpOO7R7YaanyYsxQpAAKDjAACvv85SG35CLJyIl1zOgQ",
        "description": "Отважному путешественнику Питеру Квиллу попадает в руки таинственный артефакт, принадлежащий могущественному и безжалостному злодею Ронану, строящему коварные планы по захвату Вселенной. Питер оказывается в центре межгалактической охоты, где жертва — он сам.",
        "country": "США, Великобритания",
        "director": "Джеймс Ганн",
        "genres": ["фантастика", "боевик", "комедия"]    
    },
    "068": {
        "title": "Мстители: Эра альтрона",
        "year": 2015,
        "video": "BAACAgIAAxkBAAIRimmHZ_sBOQaiFUK6FlxJlfA6s5IsAAISjwACvv9BSJ2ykyGGV7nLOgQ",
        "description": "Человечество на грани уничтожения. На этот раз людям угрожает Альтрон — искусственный интеллект, ранее созданный для того, чтобы защищать Землю от любых угроз. Однако, главной угрозой он посчитал человечество. Международная организация Щ.И.Т. распалась, и теперь мир не способен справиться с таким мощным врагом, потому люди вновь обращаются за помощью к Величайшим Героям Земли — Мстителям.",
        "country": "США",
        "director": "Джосс Уидон",
        "genres": ["фантастика", "боевик"]    
    },
    "069": {
        "title": "Человек-муравей",
        "year": 2015,
        "video": "BAACAgIAAxkBAAISPGmIZtkSUguLFnIAAd7HGPRbVWl8aAAC6JkAAornSUjR-RGIXwPnDToE",
        "description": "Вооружившись удивительной способностью уменьшаться в размере, но обладать при этом большой силой, мошенник Скотт Лэнг должен стать героем и помочь своему наставнику доктору Хэнку Пиму сохранить в тайне существование костюма Человека-муравья от угроз нового поколения.",
        "country": "США",
        "director": "Пейтон Рид",
        "genres": ["фантастика", "боевик", "комедия"]    
    },
    "070": {
        "title": "Первый мститель: противостояние",
        "year": 2016,
        "video": "BAACAgIAAxkBAAIRiGmHZ47I85Hz0kPz4wanvOArp3qrAAIOjwACvv9BSJcsyAKcN_AMOgQ",
        "description": "Мстители под руководством Капитана Америки оказываются участниками разрушительного инцидента, имеющего международный масштаб. Эти события заставляют правительство задуматься над тем, чтобы начать регулировать действия всех людей с особыми способностями, введя «Акт о регистрации супергероев», вынуждая их подчиняться ООН. Видя в этом договоре нарушение гражданских прав и плевок на всё, во что он верит, Стив Роджерс открыто восстаёт против нового режима, ведя за собой группу героев, поддерживающих его мнение. В свою очередь, Тони Старк видит смысл в новом договоре и становится во главе героев, поддерживающих его. Всё это приводит к неизбежному расколу Мстителей и войне между сторонами...",
        "country": "США, Германия",
        "director": "Джо и Энтони Руссо",
        "genres": ["фантастика", "боевик"]    
    },
    "071": {
        "title": "Доктор Стрэндж",
        "year": 2016,
        "video": "BAACAgIAAxkBAAISQGmIZ3Vqfb5sY8Bcx7Tg0X7veAeMAALxmQACiudJSIKxhw8qyZydOgQ",
        "description": "Страшная автокатастрофа поставила крест на карьере успешного нейрохирурга Доктора Стрэнджа. Отчаявшись, он отправляется в путешествие в поисках исцеления и открывает в себе невероятные способности к трансформации пространства и времени. Теперь он — связующее звено между параллельными измерениями, а его миссия — защищать жителей Земли и противодействовать злу, какое бы обличие оно ни принимало.",
        "country": "США",
        "director": "Скотт Дерриксон",
        "genres": ["фантастика", "боевик"]    
    },
    "072": {
        "title": "Стражи галактики 2",
        "year": 2017,
        "video": "BAACAgIAAxkBAAIRgGmHZgMVQwag5FmTY3G75WCasNFfAAKFjAACvv85SCL1WpiZEZpYOgQ",
        "description": "Все в сборе: землянин Питер Квилл (Звездный Лорд), молчаливый громила Дракс, зеленокожая наемница Гамора, живое дерево Грут и говорящий енот. Герои не изменяют себе и с завидной регулярностью продолжают попадать в немыслимые ситуации, выпутываясь из них почти без ущерба (а иногда даже с пользой) для окружающих. На этот раз им предстоит раскрыть одну из самых главных тайн во всей Галактике: кто же на самом деле отец Питера Квилла?",
        "country": "США",
        "director": "Джеймс Ганн",
        "genres": ["фантастика", "боевик", "комедия"]    
    },
    "073": {
        "title": "Человек-паук: возвращение домой",
        "year": 2017,
        "video": "BAACAgIAAxkBAAISSWmIa6blHPGpdnDyN8tTAAFFjFJrLQACNJoAAornSUgQG5YDp0WztDoE",
        "description": "После встречи с командой Мстителей Питер Паркер возвращается домой и пытается жить обычной жизнью под опекой тёти Мэй. Но теперь за Питером приглядывает кое-кто ещё. Тони Старк видел Человека-паука в деле и должен стать его наставником. Когда новый злодей Стервятник угрожает уничтожить всё, что дорого Питеру, приходит время показать всем, что такое настоящий супергерой.",
        "country": "США",
        "director": "Джон Уоттс",
        "genres": ["фантастика", "боевик"]    
    },
    "074": {
        "title": "Тор: Рагнарек",
        "year": 2017,
        "video": "BAACAgIAAxkBAAIRemmHZPf8rJx4dHAh2kb0sHZVGxGXAAJ3jAACvv85SG3Akq79fu5lOgQ",
        "description": "Вернувшись в Асгард в поисках таинственного врага, ведущего охоту на Камни Бесконечности, Тор обнаруживает, что действия его брата Локи, захватившего трон Асгарда, привели к приближению наиболее страшного события - Рагнарёка. По легенде это ознаменует последнюю битву Асгарда, последствием которой станет его полное уничтожение. В попытке предотвратить это событие Тору предстоит прибегнуть к помощи своего товарища из Мстителей - Халка.",
        "country": "США",
        "director": "Тайка Вайтити",
        "genres": ["фантастика", "боевик"]    
    },
    "075": {
        "title": "Черная пантера",
        "year": 2018,
        "video": "BAACAgIAAxkBAAISS2mIbBP_Gyrx6eQCDRSbsLUTKAchAAI7mgACiudJSCof_5YqkDOWOgQ",
        "description": "С первого взгляда можно решить, что Ваканда - обычная территория дикой Африки, но это не так. Здесь, в недрах пустынных земель, скрываются залежи уникального металла, способного поглощать вибрацию. Многие пытались добраться до него, разоряя всё на своём пути и принося смерть аборигенам, но каждый раз таинственный дух саванны - Чёрная Пантера - вставал на защиту угнетённых.",
        "country": "США",
        "director": "Райан Куглер",
        "genres": ["фантастика", "боевик"]    
    },
    "076": {
        "title": "Мстители: война бесконечности",
        "year": 2018,
        "video": "BAACAgIAAxkBAAIRkWmHaHCTQ0SXXpAK7nHh5C3e4oRdAAIXjwACvv9BSOU14lEGMTDgOgQ",
        "description": "Пока Мстители и их союзники продолжают защищать мир от различных опасностей, с которыми не смог бы справиться один супергерой, новая угроза возникает из космоса: Танос. Межгалактический тиран преследует цель собрать все шесть Камней Бесконечности — артефакты невероятной силы, с помощью которых можно менять реальность. Всё, с чем Мстители сталкивались ранее, вело к этому моменту — судьба Земли никогда ещё не была столь неопределённой.",
        "country": "США",
        "director": "Джо и Энтони Руссо",
        "genres": ["фантастика", "боевик"]    
    },
    "077": {
        "title": "Человек муравей и оса",
        "year": 2018,
        "video": "BAACAgIAAxkBAAISPmmIZyJu52gCYQyDcm0ZN-lF-hpLAALtmQACiudJSKSqCPxxCZbPOgQ",
        "description": "Скотт Лэнг, известный также как Человек-муравей, уже заслужил право оказаться в команде Мстителей. Но желание быть ближе к дочери удерживает его в родном Сан-Франциско до тех пор, пока доктор Хэнк Пим, создавший когда-то изменяющий размеры своего владельца чудо-костюм, не призывает Скотта присоединиться к новой опасной миссии. А помогать в противостоянии с коварным врагом Человеку-муравью будет новая напарница — Оса.",
        "country": "США",
        "director": "Пейтон Рид",
        "genres": ["фантастика", "боевик", "комедия"]    
    },
    "078": {
        "title": "Капитан Марвел",
        "year": 2019,
        "video": "BAACAgIAAxkBAAISTWmIbGKc3xaglmjVqMFa5dtM2qg6AAJAmgACiudJSDlG-KHR5BuMOgQ",
        "description": "После столкновения с враждующими инопланетными расами пилот военно-воздушных сил Кэрол Дэнверс обретает суперсилу и становится неуязвимой. Ей предстоит совладать со своими новыми способностями, чтобы противостоять могущественному врагу.",
        "country": "США, Канада",
        "director": "Анна Боден",
        "genres": ["фантастика", "боевик"]    
    },
    "079": {
        "title": "Мстители: финал",
        "year": 2019,
        "video": "BAACAgIAAxkBAAIRlWmHaOogvRtBLdt9DK3ZiLmQyjRzAAIgjwACvv9BSEzovPaIhiSCOgQ",
        "description": "Оставшиеся в живых члены команды Мстителей и их союзники должны разработать новый план, который поможет противостоять разрушительным действиям могущественного титана Таноса. После наиболее масштабной и трагической битвы в истории они не могут допустить ошибку.",
        "country": "США",
        "director": "Джо и Энтони Руссо",
        "genres": ["фантастика", "боевик", "драма"]    
    },
    "080": {
        "title": "Человек-паук: вдали от дома",
        "year": 2019,
        "video": "BAACAgIAAxkBAAIST2mIbM9kwuaESp-0PogL947DDTiEAAJFmgACiudJSOS9nSPa7vWIOgQ",
        "description": "Питер Паркер вместе с одноклассниками отправляется на летние каникулы в Европу. Однако отдохнуть приятелям вряд ли удастся — по прибытии в Венецию группа попадет в эпицентр сражения. Некое существо, состоящее из воды, появляется из ниоткуда и начинает крушить всё на своём пути, и теперь Питеру придётся спасать европейские архитектурные памятники вместе с загадочным супергероем Мистерио.",
        "country": "США, Чехия, Австралия",
        "director": "Джон Уоттс",
        "genres": ["фантастика", "боевик"]    
    },
    "083": {
        "title": "Черная вдова",
        "year": 2021,
        "video": "BAACAgIAAxkBAAISUWmIbT_cKeBdrcqFZa2C4EEQG1zCAAJLmgACiudJSHlaMlVe49sVOgQ",
        "description": "Наташе Романофф предстоит лицом к лицу встретиться со своим прошлым. Чёрной Вдове придется вспомнить о том, что было в её жизни задолго до присоединения к команде Мстителей, и узнать об опасном заговоре, в который оказываются втянуты её старые знакомые — Елена, Алексей (известный как Красный Страж) и Мелина.",
        "country": "США",
        "director": "Кейт Шортланд",
        "genres": ["фантастика", "боевик"]    
    },
    "084": {
        "title": "Шан-чи и легенда 10 колец",
        "year": 2021,
        "video": "BAACAgIAAxkBAAISVWmIbghEJ0RfILOLmv0NlFAAAfw0aQACU5oAAornSUi6O5i6meqVZToE",
        "description": "Много сотен лет назад амбициозный воин Сюй Вэньу завладел волшебным боевым артефактом — десятью кольцами, с помощью которых он победил всех врагов и создал тайную организацию. На протяжении веков он собирал армию и тайно вмешивался в ход мировой истории, но в 1996 году встретил прекрасную девушку, мастера боевых искусств скрытой от посторонних глаз деревни Та Ло, остепенился и завёл семью. Сан-Франциско, 25 лет спустя. Парень Шон работает обычным парковщиком, а вечера проводит в караоке с подругой и коллегой Кэти — большой любительницей скоростных автомобилей. Однажды по дороге на работу на приятелей нападают хорошо подготовленные воины с целью забрать у Шона подаренный матерью медальон.",
        "country": "США",
        "director": "Дэстин Дэниел Крэттон",
        "genres": ["фантастика", "боевик", "комедия"]    
    },
    "085": {
        "title": "Вечные",
        "year": 2021,
        "video": "BAACAgIAAxkBAAISV2mIbyebBSZwQMEeiMnHkgqhCypYAAJmmgACiudJSPizCn7XN4F_OgQ",
        "description": "Много тысячелетий назад с планеты Олимпия на Землю была отправлена группа сверхлюдей, обладающих суперспособностями, — Вечные. С доисторических времён они защищали человечество от нападений ужасных чудовищ девиантов, но любое другое вмешательство в развитие цивилизации им было запрещено. Начало XXI века. Уже несколько столетий прошло с тех пор, как был уничтожен последний девиант, когда после странного землетрясения внезапно объявляется новый монстр. Теперь живущим в разных уголках планеты Вечным снова придётся сплотить силы, чтобы противостоять новой угрозе.",
        "country": "США",
        "director": "Хлоя Чжао",
        "genres": ["фантастика", "боевик"]    
    },
    "086": {
        "title": "Человек-паук: нет пути домой",
        "year": 2021,
        "video": "BAACAgIAAxkBAAISU2mIbZuSMIvbm0gu0jEVjMgC13BiAAJOmgACiudJSJJCn66efnx7OgQ",
        "description": "Жизнь и репутация Питера Паркера оказываются под угрозой, поскольку Мистерио раскрыл всему миру тайну личности Человека-паука. Пытаясь исправить ситуацию, Питер обращается за помощью к Стивену Стрэнджу, но вскоре всё становится намного опаснее.",
        "country": "США",
        "director": "Джон Уоттс",
        "genres": ["фантастика", "боевик"]    
    },
    "087": {
        "title": "Доктор Стрэндж в мультивселенной безумия",
        "year": 2022,
        "video": "BAACAgIAAxkBAAISQmmIZ-V4K5LWUce9v6n83Zi5F6rvAAL6mQACiudJSFQz9wFbbhSCOgQ",
        "description": "Доктор Стрэндж при помощи Вонга спасает от гигантского осьминога девушку-подростка по имени Америка Чавес, которая при сильном испуге может открывать порталы в параллельные вселенные. Пытаясь уберечь новую знакомую от злой силы, жаждущей заполучить её способность, Доктор вместе с Америкой пускается в путешествие по мультивселенной.",
        "country": "США",
        "director": "Джон Уоттс",
        "genres": ["фантастика", "боевик"]    
    },
    "088": {
        "title": "Тор: любовь и гром",
        "year": 2022,
        "video": "BAACAgIAAxkBAAIRfGmHZUwg8j4_bDCA0DJKBltIhSOoAAJ9jAACvv85SI6gPv1yKavGOgQ",
        "description": "Джейн Фостер берет на себя обязанности Бога-громовержца и становится обладательницей молота Мьёльнира.",
        "country": "Австралия, США",
        "director": "Тайка Вайтити",
        "genres": ["фантастика", "боевик", "комедия", "мелодрама"]    
    },
    "089": {
        "title": "Стражи Галактики 3",
        "year": 2023,
        "video": "BAACAgIAAxkBAAIRgmmHZozfFaDJU9-GzewUxMvX36IRAAIDjwACvv9BSCRoCR69DxQdOgQ",
        "description": "Едва Стражи Галактики обосновываются на Забвении, на них нападает Адам Уорлок, обладающее сверхспособностями существо, созданное своей «матерью» и Верховной Жрицей суверенов Аишей. В бою Небуле удаётся победить Адама, но Ракета получает серьёзные травмы, а Стражи не могут его вылечить из-за встроенного чипа смерти, созданного компанией «Оргокорп». Они отправляются в главный штаб компании на поиски кода отмены.",
        "country": "США, Новая Зеландия",
        "director": "Джеймс Ганн",
        "genres": ["фантастика", "боевик", "комедия"]    
    },
    "091": {
        "title": "Тайна 7 сестёр",
        "year": 2017,
        "video": "BAACAgIAAxkBAAIUXmmLZaAEfF5eRvBU0WQD3OOWnUQTAAKnnwACUAhZSIqtWjydTjEXOgQ",
        "description": "В далеком будущем демографический бум приводит к нехватке еды, воды и жилья. Общемировое правительство принимает закон о политике одного ребенка в семье. В это тяжелое время рождаются семь девочек-близнецов, которых скрывает дедушка, так как мать погибла при родах. Названные в честь дней недели, они с детства обучены вести себя как один человек, чтобы хранить свою тайну от окружающих и полицейских, которые проверяют всех на каждом углу улиц. Так девушки и появляются на людях — каждая в свой день. Но однажды Понедельник пропадает.",
        "country": "Великобритания, Франция, США",
        "director": "Томми Виркола",
        "genres": ["триллер", "детектив", "боевик", "криминал"]    
    },
    # "000": {
    #     "title": "",
    #     "year": ,
    #     "video": "",
    #     "description": "",
    #     "country": "",
    #     "director": "",
    #     "genres": [""]    
    # },
    "092": {
        "title": "Обливион",
        "year": 2013,
        "video": "BAACAgIAAxkBAAIWI2mSK6HHnsEM1OZ797TLCnzx9HlpAAI0ngACz8aRSFJZlZplajRgOgQ",
        "description": "Земля, пережившая войну с инопланетными захватчиками, опустела; остатки человечества готовятся покинуть непригодную для жизни планету. Главный герой — техник по обслуживанию дронов — находит разбившийся корабль NASA, команда которого погибает у него на глазах. Ему удаётся спасти лишь одну женщину — и вскоре он понимает, что это перевернёт его жизнь.",
        "country": "США",
        "director": "Джозеф Косински",
        "genres": ["научнаяфантастика", "мелодрама", "триллер"]    
    },
    "093": {
        "title": "Спеши любить",
        "year": 2002,
        "video": "BAACAgIAAxkBAAIWJWmSK-CJRf5CeVIQIlOHMasM-T4eAAI4ngACz8aRSCwa7pHw_uipOgQ",
        "description": "Лэндон Картер - кумир своей школы: он независим, красив и жесток к изгоям. И конечно, он не замечает невзрачную Джейми, думающую только об учебе. После очередной дурацкой выходки Картера заставляют заниматься с отстающими и играть в школьном спектакле. Тут уж ему не обойтись без помощи скромной отличницы. Джейми соглашается помочь Лэндону, но только если он пообещает, что не будет влюбляться в неё. Самонадеянный парень охотно дает клятву, но вскоре он убедится, что сдержать её будет очень непросто...",
        "country": "США",
        "director": "Адам Шенкман",
        "genres": ["мелодрама", "драма"]    
    },
}

series = {
    # "000": {
    #     "title": "",
    #     "year": 1,
    #     "episode_counter": "",
    #     "description": "",
    #     "poster": "",
    #     "country": "",
    #     "director": "",
    #     "genres": [""],
    #     "seasons": {
    #         1: {
    #             "title" : "Сезон 1",
    #             "episodes": [
    #                 {
    #                     "title": "",
    #                     "video": "",
    #                 },
                    
    #             ]
    #         },
    #     }
    # },
    "004": {
        "title": "Алиса в пограничье",
        "year": 2020,
        "episode_counter": "22 серии",
        "description": "Японский геймер по имени Рёхэй Арису случайно устраивает аварию на пешеходном переходе и жестоко за это расплачивается. Его переносит в альтернативный Токио, в котором практически нет людей, а немногочисленные жители вынуждены играть в странные игры. Этот мир — арена, и её нельзя покинуть самовольно. Теперь Рёхэй Арису и его друзья должны следовать правилам.",
        "poster": "AgACAgIAAxkBAAISgmmIlHh_ZISWdlspR3DE5LMjghEUAAJ7FGsbiudJSLH1YBglaJ_nAQADAgADeAADOgQ",
        "country": "Япония",
        "director": "Синсуке Сато",
        "genres": ["триллер", "драма", "фантастика", "дорама"],
        "seasons": {
            1: {
                "title" : "Сезон 1",
                "episodes": [
                    {
                        "video": "BAACAgIAAxkBAAISjGmImZFQ8--0nY1qeOEAATsKwn4vvwAC65wAAornSUjPP4qtKX2oEDoE",
                    },
                    {
                        "video": "BAACAgIAAxkBAAISjmmImenGmbtf6WisCtgfizRmtbvRAAL1nAACiudJSAL_fu_CCL1QOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAISkmmImjPl3WgPTnfG_GeTgMlkJjIiAAL7nAACiudJSGDIGaQDOHaLOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAISlmmImoTSBLbwRy0bTLLVXgE8n0G6AAOdAAKK50lIVd-yGaXoeFk6BA",
                    },
                    {
                        "video": "BAACAgIAAxkBAAISmGmImt4vAt5YfRl7WlndM9GPee0VAAIEnQACiudJSGCaDQl4S2ymOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAISmmmImyaVVxpusopYGB-uCp_a3bnfAAIKnQACiudJSCtZbP96ZuUFOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAISnGmIm3qYWqR9Yiu2ibFHdCqcEjtOAAIUnQACiudJSALg9AIDS7bEOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAISnmmIm9ULhAJYtMRULNuXkcjKF7NZAAIYnQACiudJSMHSV1bM-cyLOgQ",
                    },
                ]
            },
            2: {
                "title" : "Сезон 2",
                "episodes": [
                    {
                        "video": "BAACAgIAAxkBAAISs2mIowibLLoWhiPBCsS_OC0D1FUFAAKpnQACiudJSAFCW8dep5tvOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAISuGmIo3_rNVS4lw7HbghMNC7jo_ySAAKtnQACiudJSD6K0rZtDxZqOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAISummIpARLkokP3B_E-CyJVzHPASNfAALbnQACiudJSA09VnaaeEltOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAISvGmIpGtFgScnu-zBO-ZQt8l2BTi5AALmnQACiudJSPyR9bhzz8NTOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAISvmmIpQABwaZd5IxA2XP-vx9_OReSwQADngACiudJSJYVcoKuYhzUOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAISwmmIpaPbr3TJFQxw5tZ-ozFqEjFEAAIangACiudJSLWA1ckSt3_1OgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAISx2mIpjVN-urtm3jsKXjoe0rX9C-pAAI2ngACiudJSEqNHqHx6jt4OgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAISyWmIptyC42ESM4Azcw4_xrXNRvxMAAJJngACiudJSBgQSHd9smosOgQ",
                    },
                ]
            },
            3: {
                "title" : "Сезон 3",
                "episodes": [
                    {
                        "video": "BAACAgIAAxkBAAIS62mIrccONzfJ8VZkxa1-1fXjBseQAAKbngACiudJSDRp2FlIgfRCOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIS7WmIri-7HePIYKJUBTxkt5zs0tb5AAKkngACiudJSI21lGLkiZygOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIS72mIrqQXuNiVEcWW8CGYytiM-Hd0AAKtngACiudJSHIvDM3tq8zYOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIS9WmIrxcy_1hmpxrgwwnTX6VNkkvQAAKzngACiudJSH6z2WcD9kGQOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIS-GmIr6r0Sxq-fKOVfucRWs-NT2sUAAK9ngACiudJSBUDmk4Lr8l5OgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIS-mmIsDwUjF1CvvGScWoo1XSSy6OtAALAngACiudJSOMmY2nDLIZIOgQ",
                    },
                ]
            },
        }
    },
    "007": {
        "title": "Любовь, смерть и роботы",
        "year": 2019,
        "episode_counter": "45 серий",
        "description": "В каждой серии отдельный сюжет и своя мини вселенная.",
        "poster": "AgACAgIAAxkBAAIKqml4-4ehfa2duAbRv0c0S0bOlw9VAAI5C2sbe8zIS0z2lHElrCDJAQADAgADeQADOAQ",
        "country": "США",
        "director": "Дэвид Финчер",
        "genres": ["фантастика", "мультфильм"],
        "seasons": {
            1: {
                "title" : "Сезон 1",
                "episodes": [
                    {
                        "title": "Преимущества Сонни",
                        "video": "BAACAgIAAxkBAAIKTml49aABLadjojcVbdMcuDZ7IrYWAALEkwACe8zAS2twv-KI9PqiOAQ",
                    },
                    {
                        "title": "Три робота",
                        "video": "BAACAgIAAxkBAAIKUGl49cPB6VY9p6eZiOC54L5fR_GbAALFkwACe8zAS7wmBRBu6kP2OAQ",
                    },
                    {
                        "title": "Свидетель",
                        "video": "BAACAgIAAxkBAAIKUml49deIyt_oLs5wOdSizNl4YlL3AALHkwACe8zAS03kYsM3GL0fOAQ",
                    },
                    {
                        "title": "Костюмы",
                        "video": "BAACAgIAAxkBAAIKVGl49ezUbTtzmuHwjGgGKZmJQGDjAALIkwACe8zAS0IRmd-Iv7RPOAQ",
                    },
                    {
                        "title": "Глотатель душ",
                        "video": "BAACAgIAAxkBAAIKVml49f1jCI1h0Dl3DG3FLXdtfhVkAALKkwACe8zAS0W5slxgVPkqOAQ",
                    },
                    {
                        "title": "Когда йогурт захватил мир",
                        "video": "BAACAgIAAxkBAAIKWGl49geEQgrNZB95UDcFpfJQfr9GAALLkwACe8zAS_eJi3cEm8C4OAQ",
                    },
                    {
                        "title": "За разломом орла",
                        "video": "BAACAgIAAxkBAAIKWml49iFCaDfa-STVzwG84RW11nvkAALOkwACe8zAS9O7S7vM6ar4OAQ",
                    },
                    {
                        "title": "Доброй охоты",
                        "video": "BAACAgIAAxkBAAIKXGl49jKZbxyOaHDfD4tGTPOBUay-AALRkwACe8zAS5H2oU8AAbLMPDgE",
                    },
                    {
                        "title": "Свалка",
                        "video": "BAACAgIAAxkBAAIKXml49kDTvsHjKvRhQjYnxU7caC68AALUkwACe8zAS1Z3bqwUcE05OAQ",
                    },
                    {
                        "title": "Оборотни",
                        "video": "BAACAgIAAxkBAAIKYGl49lqxGlFOOCB_VjQ38PdHkRwXAALXkwACe8zAS0ljEGCcfJEZOAQ",
                    },
                    {
                        "title": "Рука помощи",
                        "video": "BAACAgIAAxkBAAIKYml49mUs396Qnd3G_VeKjOrZhvZiAALYkwACe8zASxemx66VvTxvOAQ",
                    },
                    {
                        "title": "Рыбная ночь",
                        "video": "BAACAgIAAxkBAAIKZGl49pOgmjxPvZGd7DdiBxtmzUQoAALbkwACe8zAS1VGREwUdMDfOAQ",
                    },
                    {
                        "title": "Счастливая тринашка",
                        "video": "BAACAgIAAxkBAAIKZml49qabxyQnm6Rx6ND8mmo3IwuqAALdkwACe8zASwmxMPWBZ4hvOAQ",
                    },
                    {
                        "title": "Зима блю",
                        "video": "BAACAgIAAxkBAAIKaGl49rbvflp5GVgtzYAJRWGsE8RYAALfkwACe8zASw3NQuvvMgwuOAQ",
                    },
                    {
                        "title": "Слепое пятно",
                        "video": "BAACAgIAAxkBAAIKaml49sSojSdZj2ml4mXdDZ9sfjMqAALgkwACe8zAS-L9i_uVIzrnOAQ",
                    },
                    {
                        "title": "Ледниковый период",
                        "video": "BAACAgIAAxkBAAIKbGl49tC_QhzSQsuRG5EwFmeSk10bAALikwACe8zASw3P9VPiH2gLOAQ",
                    },
                    {
                        "title": "Исторические альтернативы",
                        "video": "BAACAgIAAxkBAAIKbml49tyaSXUrBaNyoW1Rb2X2Z-mZAALjkwACe8zASx3SVLpRpx9xOAQ",
                    },
                    {
                        "title": "Тайная война",
                        "video": "BAACAgIAAxkBAAIKcGl49viJmKFwrZzksJeCg4gSm2XIAAKCigACe8zISzb-ask-CwWhOAQ",
                    },
                ]
            },
            2: {
                "title" : "Сезон 2",
                "episodes": [
                    {
                        "title": "Автоматизированная клиентская служба",
                        "video": "BAACAgIAAxkBAAIKcml49_cG8H6Rehj8Cd7i-N70PASIAAKWigACe8zISxrejB9__2YlOAQ",
                    },
                    {
                        "title": "Лед",
                        "video": "BAACAgIAAxkBAAIKdGl4-AfAp7sJStQ8LTDZEfxdM4ohAAKYigACe8zISyoINno2lbGYOAQ",
                    },
                    {
                        "title": "Звездная команда",
                        "video": "BAACAgIAAxkBAAIKdml4-BjWWf7hzARrLudW4kP9lSHoAAKZigACe8zIS-ABrEZChJfVOAQ",
                    },
                    {
                        "title": "Сноу в пустыне",
                        "video": "BAACAgIAAxkBAAIKeGl4-CfpVnkyEdNqMCQZbgxU4ghBAAKbigACe8zIS2U9gUFChSxbOAQ",
                    },
                    {
                        "title": "Высокая трава",
                        "video": "BAACAgIAAxkBAAIKeml4-DPdXpTnxetm7zYyHj2vBtAQAAKfigACe8zISxu1-rLanhc4OAQ",
                    },
                    {
                        "title": "По всему дому",
                        "video": "BAACAgIAAxkBAAIKfGl4-D2bVqbr5PzYUut7ydZL-Q24AAKgigACe8zIS-8ZITbvFBCxOAQ",
                    },
                    {
                        "title": "Бункер",
                        "video": "BAACAgIAAxkBAAIKfml4-EySkLX7v5FutJJdM2Swa5P7AAKhigACe8zISxt6qZTc8jRpOAQ",
                    },
                    {
                        "title": "Утонувший великан",
                        "video": "BAACAgIAAxkBAAIKgGl4-FoIWf94EZlGwsdLkFQJaq5lAAKiigACe8zIS6Tm1BEFbOH-OAQ",
                    },
                ]
            },
            3: {
                "title" : "Сезон 3",
                "episodes": [
                    {
                        "title": "Три робота: Стратегии выхода",
                        "video": "BAACAgIAAxkBAAIKgml4-IMZZ23ecwzHy6r7HbBPyPPIAAKkigACe8zIS51PxKXJ53-lOAQ",
                    },
                    {
                        "title": "Плохая поездка",
                        "video": "BAACAgIAAxkBAAIKhGl4-JVPmdv-znXcGB8r4UvEkWYVAAKligACe8zIS35EIWMhxR39OAQ",
                    },
                    {
                        "title": "Живой пульс машины",
                        "video": "BAACAgIAAxkBAAIKhml4-KyNXXN-wFB3XTrNIEUglM82AAKoigACe8zIS6EtN9GbmHMgOAQ",
                    },
                    {
                        "title": "Ночь мини-мертвецов",
                        "video": "BAACAgIAAxkBAAIKiGl4-LX5iGhPUfKwmMGVeuyT_JzUAAKpigACe8zIS2EJvY-s056EOAQ",
                    },
                    {
                        "title": "Убей, команда, убей",
                        "video": "BAACAgIAAxkBAAIKiml4-MeZTw7v90CdX1zAkkv2de1PAAKrigACe8zIS3v9KBuMzPNTOAQ",
                    },
                    {
                        "title": "Рой",
                        "video": "BAACAgIAAxkBAAIKjGl4-NgH93nTm92hep2K--D2fjBFAAKvigACe8zIS-5iy1IPmcsqOAQ",
                    },
                    {
                        "title": "Крысы Мейсона",
                        "video": "BAACAgIAAxkBAAIKjml4-OT0lHwuEVUhwKyZmbSE6jfRAAKwigACe8zIS9wBHwJ4WjXEOAQ",
                    },
                    {
                        "title": "Погребённые в сводчатых залах",
                        "video": "BAACAgIAAxkBAAIKkGl4-PSjNBP6pQF1ItPG9CFJREWPAAKxigACe8zIS4STi1vZ5uNBOAQ",
                    },
                    {
                        "title": "Хибаро",
                        "video": "BAACAgIAAxkBAAIKkml4-Rg2puSKVXWoQQbMHrkmxnTiAAK1igACe8zIS0_RWVT4covWOAQ",
                    },
                ]
            },
            4: {
                "title" : "Сезон 4",
                "episodes": [
                    {
                        "title": "Неудержимые",
                        "video": "BAACAgIAAxkBAAIKlGl4-Sn6kVUnlK20F3c_gy9ijC8bAAK5igACe8zIS4MwHU1SZnRNOAQ",
                    },
                    {
                        "title": "Контакт миниатюрного масштаба",
                        "video": "BAACAgIAAxkBAAIKlml4-TKPfRDVOIOiCEYtmwuhN8QuAAK6igACe8zIS30K2y8fsC5tOAQ",
                    },
                    {
                        "title": "Паучья роза",
                        "video": "BAACAgIAAxkBAAIKmGl4-UAOdULQk-CmEBBm3D0pRwEOAAK7igACe8zISy_CqTR0SNNoOAQ",
                    },
                    {
                        "title": "Четыреста мальчиков",
                        "video": "BAACAgIAAxkBAAIKmml4-U8-DSovzLs1N8FwLv0abPXRAAK9igACe8zIS4cJKg52fv0POAQ",
                    },
                    {
                        "title": "Другая большая штука",
                        "video": "BAACAgIAAxkBAAIKnGl4-Vlq_9tvfr9VfMxmQl08ERRJAAK-igACe8zIS-amSKG_uf13OAQ",
                    },
                    {
                        "title": "Голгофа",
                        "video": "BAACAgIAAxkBAAIKnml4-WZ_xjxyOOOHFbF64R62fJgpAALAigACe8zIS79D9r0lJv5iOAQ",
                    },
                    {
                        "title": "Крик тираннозавра",
                        "video": "BAACAgIAAxkBAAIKoGl4-Xmsy4ypShNTI2ucfbY8CE8oAALBigACe8zIS__E4KZeHOKmOAQ",
                    },
                    {
                        "title": "Как Зик обрёл веру",
                        "video": "BAACAgIAAxkBAAIKoml4-YqrXMMkkU3854hDKkASac-wAALCigACe8zIS_0KB-u-OyHzOAQ",
                    },
                    {
                        "title": "Умные приборы, глупые хозяева",
                        "video": "BAACAgIAAxkBAAIKpGl4-ZJYVimXkcOGdv-hnJRwLc0wAALFigACe8zISygV-wAB8e72eTgE",
                    },
                    {
                        "title": "Ибо он может красться",
                        "video": "BAACAgIAAxkBAAIKpml4-ac2ZFBqylOzYAq72FmecwHZAALHigACe8zISzFgR9IiN8IxOAQ",
                    },
                ]
            },
        }
    },
    "010": {
        "title": "Изобретая Анну",
        "year": 2022,
        "episode_counter": "9 серий",
        "description": "Анна Делви, также известная как Анна Сорокина, под видом наследницы богатой немецкой семьи проникает в высшее общество Нью-Йорка.",
        "poster": "AgACAgIAAxkBAAIFFmlyTYbeE_aciTdJTMKNxQjlzYhpAALlEmsbk1iRS7Xo4rDBJIlNAQADAgADeQADOAQ",
        "country": "США",
        "director": "Шонда Раймс",
        "genres": ["драма", "биография"],
        "episodes": [
            {
                "video": "BAACAgIAAxkBAAIFP2lyUgpeSIUksrlYTYIS-mUl6RTUAAIbkgACk1iRS72dqA69ayiAOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFQWlyUjkXqEJJjaBeYEs1FZDwE5N9AAIjkgACk1iRSyqASDWZkUEiOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFQ2lyUl-MKlDrnRODTBJCUyk_mLIVAAIokgACk1iRS0yNnFjozF2AOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFRWlyUof4s6HGxhUkewJBiaCu8YuFAAItkgACk1iRS7QQ7B8eFnvKOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFR2lyUq8GEyb4w6TtIRpxrnysUjdVAAIzkgACk1iRS92J78PWmPxmOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFSWlyUt9OBFXDGrMxl29Gs6jrMaXrAAI8kgACk1iRS6e7G7FHk9xZOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFS2lyUwQmBr5xTeXrH1k2PoRvuVKLAAJEkgACk1iRSwf07M6ZAZcyOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFTWlyUzEyvghHQjiLf62OIwABaBugfwACTZIAApNYkUtceKwu6XnkIjgE",
            },
            {
                "video": "BAACAgIAAxkBAAIFT2lyU2KqvM4CmTZ_RWoK3TIMBf6aAAJTkgACk1iRSwIQoTNZGfRIOAQ",
            },
        ]
    },
    "015": {
        "title": "Манифест",
        "year": 2018,
        "episode_counter": "62 серии",
        "description": "Пассажиры и экипаж коммерческого авиалайнера внезапно появляются после того, как более пяти лет считались погибшими. Когда самолёт приземляется в аэропорту, они узнают, что за те несколько часов, которые они побывали в небе, весь остальной мир умудрился постареть на пять лет.",
        "poster": "AgACAgIAAxkBAAIS_GmIsGSkzmdQUxV32wUwsHUmrIppAAINFmsbiudJSPcHxA-4DwFjAQADAgADeQADOgQ",
        "country": "США",
        "director": "Дэвид Фрэнкел, Ромео Тироне, Майкл Смит, Дин Уайт, Клаудия Ярми, Марисоль Торрес",
        "genres": ["мистика", "драма"],
        "seasons": {
            1: {
                "title" : "Сезон 1",
                "episodes": [
                    {
                        "video": "BAACAgIAAxkBAAIS_mmIsjNAyy5rSTj1sTeHARStSqIFAALjngACiudJSCeieTCWiT_hOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITAAFpiLJLRrw4CqCE_B8xdU2ocIklsAAC5Z4AAornSUiDVdlgNYAO1ToE",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITAmmIsl-bVJItq6tYmFZ_4VJAQjA0AALmngACiudJSIlFy2mb_FV_OgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITBGmIsndj4tzCMWAkjUaRr6zThUaOAALongACiudJSAMXek8bQptaOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITBmmIso0KSSbWE04qzU18zqfxuSNQAALqngACiudJSC91bGd8e1NIOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITCGmIsqUEzlSBof37e23kKrdG28MaAALrngACiudJSOHi9gWhNh5iOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITCmmIsr293zH-u_0c_SA3nFontsTfAALsngACiudJSCIjxbW3ydfAOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITDGmIstQo3kBmiPmhtnbVZ13WiqDsAALtngACiudJSAABo285JZhlojoE",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITDmmIsvDoZb5InnAxnb39Of6-7XpJAALungACiudJSKfwD2VLhDZsOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITEGmIswjzNg_q-f0Y1f6DkEgaFCQqAALvngACiudJSArKFUuUfhqyOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITEmmIsx_QG_zmfyEa5tG2AAGj2FUyHQAC8Z4AAornSUheshljQrj7tzoE",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITFGmIszTo5oUdGxjba75d-1NxoGa9AAL0ngACiudJSLQcIxkx7GPIOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITFmmIs0wQE7lVsX6nnai490InjgS4AAL1ngACiudJSMxCorbW-bLGOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITGGmIs2JfT9dORDAfKXooUjDML7j7AAL3ngACiudJSOm6E26DqLjBOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITGmmIs3ttw-DkTo0TXhQgLJiMwyAfAAL8ngACiudJSGJ-TF4fV52LOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITHGmIs5OkAAFJdIiglLWKVf0zVcTz3wAC_p4AAornSUgmHpydIYrmdDoE",
                    },
                ]
            },
            2: {
                "title" : "Сезон 2",
                "episodes": [
                    {
                        "video": "BAACAgIAAxkBAAITJ2mItXy7sRnZI50g7awNHB5UVP50AAIdnwACiudJSEE9uuPCiIAoOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITKWmItZkanNYPgt4by_IrAxIMTRMjAAIhnwACiudJSOJNehoVSZ7QOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITK2mItbTyuZ5Q8hwLRxwopOeiqUomAAIjnwACiudJSM9kni9GElesOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITLWmItdBKMZrz9HLDi7Fj9D0qWRh6AAIknwACiudJSNciOVl1XoYsOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITL2mItem3fXyiYPJkHboRRjv3pYpiAAIlnwACiudJSOgvFk93hO48OgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITMWmItgWKB0npLxpwQIkwmTxi2sJ4AAImnwACiudJSEGGDc-Bz88TOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITM2mItiMkIMUGnbhKVpfBNY-WwgG9AAInnwACiudJSJ0x6-xiSw9COgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITNWmItjnfNwz-q5WkLzFdXTdtinS_AAIonwACiudJSDHfA19wnC1sOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITN2mItlL7hKmvHx9eDA0C_CYs-GtAAAIrnwACiudJSIBBx2xcR8juOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITOWmItmw5mmN_onCxbQMuq9eN79GQAAItnwACiudJSJWY-ZJ2dA3SOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITO2mItoP2VvZ2wEYRQH665c4mzgz3AAIunwACiudJSMPOpKUv-fAROgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITPWmItpxC0oZ8YFksIEIqN68CBvbyAAIznwACiudJSKYhEZImry69OgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITP2mItrXXyptKIwhTotwSSrLWbemgAAI1nwACiudJSAO2N1zesXkLOgQ",
                    },
                ]
            },
            3: {
                "title" : "Сезон 3",
                "episodes": [
                    {
                        "video": "BAACAgIAAxkBAAITRWmIuixEun5LlZrqz6v04Z23RuXwAAJqnwACiudJSHEl9NTbB-qoOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITR2mIukzTAAE99vJ0liecllisIbKJlwACbZ8AAornSUjojYY7YEKB1ToE",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITSWmIumvwlxnN-bL9_-o5k9wwBxCyAAJvnwACiudJSPUDKRytLyBnOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITS2mIuoflv2sYZCHXYu_2dbKchQlvAAJ0nwACiudJSDOh5fB6IRc1OgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITTWmIuqALuBDZ2q89l7pElvDigAc0AAJ2nwACiudJSJumc92_z-dHOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITT2mIusj4FmfBY0pHLOICGGanxHpTAAJ7nwACiudJSHfKXhABn6OiOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITUWmIut8QZ7b9KrX4UCS6ZPT4W5G3AAJ-nwACiudJSObFsq12c9p8OgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITU2mIuvbLcdVGqxezoeZ-xb30J0GhAAKCnwACiudJSNbAJPi4YDprOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITVWmIuwpwJbTuY0PIhMks3QQNamQpAAKFnwACiudJSOhbPp5gGpoWOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITV2mIuyVVzhd8kINCEIenkngcsEWsAAKKnwACiudJSPtSk7TIN05EOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITWWmIuzoUJg_X21omyPsfkZzjR9eRAAKNnwACiudJSEQcOAVWOru5OgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITW2mIu1NpjP09tt9kfI1SW_oDDk61AAKQnwACiudJSA3-dvroRYimOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITXWmIu236w4SxqAZkG6xTrky41_ATAAKSnwACiudJSNAk1T2RZG26OgQ",
                    },
                ]
            },
            4: {
                "title" : "Сезон 4",
                "episodes": [
                    {
                        "video": "BAACAgIAAxkBAAITaGmIwECz2kjiy9zgzmzVliTZc3X2AALfnwACiudJSKK9rslsgmhqOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITammIwGFg7iJFuQ3HPlumyqKIKfYCAALjnwACiudJSBIIQFPnCzQeOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITbGmIwH6Nuy_jQQpuk4oeBlSlRSGHAALlnwACiudJSPwWutPhJS0vOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITbmmIwJqU89kfaHR_9sgpls5bN01UAALqnwACiudJSEaxSHMZ8wIGOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITcGmIwL4tSz5feLwJjXGskaO2byJsAALunwACiudJSA1f0iy1wqkCOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITcmmIwOJehpzkTvj4_-R7elx3ycTsAALxnwACiudJSI__7t76JdkMOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITdGmIwQK9hvErHW_wnnpMqqjLWXekAALznwACiudJSLhdWu-IhvHDOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITdmmIwSRqMvjURHZlaxeeyNVbByRpAAL1nwACiudJSEOYWLZxbRPyOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITeGmIwT7C6F8pqb5O3zV6vVAyRBI-AAL6nwACiudJSNAxb0-KkhXlOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITemmIwVv8naWShfPk_4uzSg8-WWBOAAL8nwACiudJSC1-fQc7x-z5OgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITfGmIwYB--tNvkr9sBxkLA8zsX5_KAAL-nwACiudJSIUGeljDzT6VOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITfmmIwaQVbWy-DPMRxQIjARSofRnyAAOgAAKK50lIhGV8TJjax4k6BA",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITgGmIwcWr1KDZglM67FRC0EzHHpVbAAIBoAACiudJSPF_qtmDhgABkzoE",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITgmmIweF3QRo0RME-NRIH1tpnONQ-AAIEoAACiudJSN2itlWlRV-cOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIThGmIwgFbiDgyG_E4k9eQVTZkgqCPAAIFoAACiudJSFz3ajuDdySrOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIThmmIwiCiQ_YUqPFstzr1wJgK0E9vAAIKoAACiudJSCCtM0hlrwVTOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITiGmIwj8M5ey5gCc3q1rcmkz8fuU9AAIMoAACiudJSMAoVH1tKdFfOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITimmIwlq8Ymglf2IB-vUJ6KcDk6DcAAIPoAACiudJSM8452cEyieAOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITjGmIwndzWLoIV-Vpc6S84rkis6F9AAIRoAACiudJSP4CcQn6kF-tOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAITjmmIwqa89YlqnE_6j2e_qCoIfFPDAAIToAACiudJSHBGI2GJRpZcOgQ",
                    },
                ]
            },
        }
    },
    "016": {
        "title": "Душегубы",
        "year": 2021,
        "episode_counter": "20 серий",
        "description": "Старший следователь прокуратуры Леонид Ипатьев попадает в эпицентр охоты на самых опасных маньяков Советского Союза. Его работа — не просто расследования, это противостояние со злом, прячущимся под маской добропорядочности.",
        "poster": "AgACAgIAAxkBAAIVfmmPKfntazuj9emhb5SvqaE2F7x1AAKJGGsbKTp4SP-r9HBPl-wWAQADAgADeAADOgQ",
        "country": "Россия",
        "director": "Давид Ткебучава",
        "genres": ["детектив", "криминал"],
        "seasons": {
            1: {
                "title" : "Сезон 1",
                "episodes": [
                    {
                        "video": "BAACAgIAAxkBAAIVUGmPJsD0LsZ5vM453GlFLYAM3C8EAAKTkAACKTp4SHcqiHhdqQrzOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVUmmPJto5bB3Ezihqeap35DWdKECxAAKXkAACKTp4SAa1oMimrXXVOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVVGmPJvUO8_zp3_1JOCy-Cqil00LpAAKakAACKTp4SE6veFhp3aIOOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVVmmPJxC_xfG4S59psbLZQHFimc1MAAKfkAACKTp4SKpXvlUXk4oMOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVWGmPJ2ae7Fhw6N8uWcP0rUcl1wKBAAKskAACKTp4SP8IbwMwpQL5OgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVWmmPJ38zczaQrSy9UFnG4apwjbQkAAKtkAACKTp4SN2UsG9h-cmMOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVXGmPJ5uEdXp0BfYB41Y6C34KlIOyAAKwkAACKTp4SMApeJVLzVnrOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVXmmPJ7MWIYKugYCqweODDtHtpNZ2AAKykAACKTp4SCsf65Z6exd1OgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVYGmPJ8kUs4Dt0ZiTh3QgN3z004pmAAKzkAACKTp4SKiorS5OpL5POgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVYmmPJ-LBaokOL7UOgHyXxc4XywAB-AACuJAAAik6eEigjK_b3ciVFjoE",
                    },
                ]
            },
            2: {
                "title" : "Сезон 2",
                "episodes": [
                    {
                        "video": "BAACAgIAAxkBAAIVZGmPJ_ivie_Q-hf9t09Rg2ofjvqhAAK5kAACKTp4SFOkUom6N0kdOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVZmmPKBTxDR2GDQPM_CFUc2M7F5qWAAK9kAACKTp4SO8Xaorc3xJ-OgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVbWmPKC_7V0Gmbn39MBW2NghpHyXqAAK-kAACKTp4SFBiXHWArxO3OgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVcGmPKElGLt-YWf2G30vaZxWKxfi9AALAkAACKTp4SAABJCCgZN7I0DoE",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVcmmPKGJTjmy9MOThL-xVKoDOhyPFAALCkAACKTp4SHzAtYFkgjz6OgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVdGmPKHwhP5qvm_H2p9y7nXgXZ9ubAALGkAACKTp4SEPNO5xuSm-VOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVdmmPKJZ1mqAVGCpP0P3HsHofPdDnAALHkAACKTp4SKnnrUTSGBFMOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVeGmPKLDo4vdqMKL8-HPn-aTWQGnxAALJkAACKTp4SA4JKSV4KBJIOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVemmPKMlMNaJ6sg-vwfnSvB1CrXS1AALMkAACKTp4SApL5shkb9gHOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVfGmPKOM3nWdf1UogqzXiI2q8fGtIAALPkAACKTp4SMll4GKThk2dOgQ",
                    },
                ]
            },
        }
    },
    "017": {
        "title": "Пассажиры",
        "year": 2020,
        "episode_counter": "16 серий",
        "description": "Водитель необычного такси возит души до их места назначения, но чтобы добраться, им сперва нужно признаться, что держит их на Земле.",
        "poster": "AgACAgIAAxkBAAIVgGmPKwAB-6T1iURCEU3RPJhltlD9uAAClhhrGyk6eEiv5zpDX0B8_QEAAwIAA3gAAzoE",
        "country": "Россия",
        "director": "Карен Оганесян",
        "genres": ["драма", "мистика"],
        "seasons": {
            1: {
                "title" : "Сезон 1",
                "episodes": [
                    {
                        "video": "BAACAgIAAxkBAAIVh2mPOFA1DuMzBwuJ8pS8nbdB_DibAAKLkQACKTp4SG1IRJtgUVAqOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIViWmPOHbNUMvS89JvDTMZBWwqz8CBAAKPkQACKTp4SKj5-8pI7q10OgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVi2mPOJrxDXi7-zsvJ8XIVkAS1irkAAKQkQACKTp4SIFM_v6mXWSUOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVjWmPOMPqEsFCgZQePPFC-VDH4im3AAKSkQACKTp4SEmqj9togHXtOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVj2mPOOumCSEgQA7w4IR-ZkyVLMB0AAKUkQACKTp4SDKibsJexO0SOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVkWmPORGhr6eW1ULCTsdVGx2l4oKOAAKWkQACKTp4SJb9IHPgqxWbOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVk2mPOUHW6t2PePuZgbjLAccv57C3AAKakQACKTp4SJlZatUwD4khOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVlWmPOWvh5DX3L5Nl6KTffpZH4j9uAAKbkQACKTp4SINHlM9rAAFJUToE",
                    },
                ]
            },
            2: {
                "title" : "Сезон 2",
                "episodes": [
                    {
                        "video": "BAACAgIAAxkBAAIVl2mPOZ18OveXMr5BU7ENjDaMmSCyAAKckQACKTp4SJhgcVF08uCiOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVmWmPOcePyAu6cp8jYgABExr4wroNoQACnZEAAik6eEgzmVFkVxcU1ToE",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVm2mPOfGYVmGSVQdZeheXfUUvJiYHAAKikQACKTp4SBuxssDuW6CuOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVnWmPOhtwgIjD03lW4fy4G7lWgfI1AAKkkQACKTp4SA-JxE6UPPxVOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVn2mPO8MZ2SAIhUYZuwN1KqlUC9YeAAK6kQACKTp4SMhaAAHZS6DzBToE",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVoWmPO8OMxCVcLQ94E5zk3kfDpv6uAAK8kQACKTp4SEEQQKTSUDqEOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVommPO8N4_zeFmcEUbx5Vw3522rv4AAK9kQACKTp4SFR1EF4kyXXWOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIVoGmPO8PDhgVjTe9gyNIeatMOfeixAAK7kQACKTp4SD2eC7c0nQABqDoE",
                    },
                ]
            },
        }
    },
    "019": {
        "title": "11/22/63",
        "year": 2016,
        "episode_counter": "8 серий",
        "description": "Учитель английского языка отправляется в прошлое, чтобы предотвратить убийство Кеннеди, но в результате сильно привязывается к той жизни, которая у него появилась в ушедшей эпохе.",
        "poster": "AgACAgIAAxkBAAIFGGlyTcwlgE7naqzzu676pm6fAUWkAALmEmsbk1iRSw5XXaQ15A__AQADAgADeQADOAQ",
        "country": "США",
        "director": "Кевин Макдональд",
        "genres": ["драма", "фантастика", "детектив"],
        "episodes": [
            {
                "video": "BAACAgIAAxkBAAIFWWlyU_qV_qpNnrve2RGgEN4OoZT3AAJmkgACk1iRSw7mkqzCLkzfOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFW2lyVHOJX5aL15_EtBJuFdpL1aWCAAJ9kgACk1iRS2vjZz2d2sLLOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFXWlyVKkuM-AOVX5R0z_90JZCEyauAAKCkgACk1iRS2bu2-edoXrpOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFX2lyVPhgGLpcwAPi-YeSe84hVhjsAAKIkgACk1iRS8QZDT2ngFXjOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFYWlyVV8BqbuKieLuZBv9PrdwTdeZAAKRkgACk1iRS4llYbmjdco7OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFYWlyVV8BqbuKieLuZBv9PrdwTdeZAAKRkgACk1iRS4llYbmjdco7OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFY2lyVY4xPYbS0_ExsGuVZkjjy_dJAAKZkgACk1iRS7fOOIzXiYIuOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFZWlyVbY_H0TmlNb0WIVnqXiLQt4jAAKekgACk1iRS4oFfSahMtEzOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFZ2lyVeapHUXQpOwkX3lNR-Ex9HNVAAKnkgACk1iRS8ZaYJ5MOKFQOAQ",
            },
        ]
    },
    "029": {
        "title": "Великолепный век",
        "year": 2011,
        "episode_counter": "139 серий",
        "description": "Османская империя, XVI век. Девушка Александра попадает в плен к туркам и получает новое имя Хюррем. На её долю выпадает немало испытаний, а позже она становится первой официальной женой султана Сулеймана І.",
        "poster": "AgACAgIAAxkBAAIC9mlxSbmNoUJDub1c3a3lM18fNwWyAAJXDmsb3hGISwVmModBFR_XAQADAgADeQADOAQ",
        "country": "Турция",
        "director": "Дурул Тайлан и др.",
        "genres": ["драма", "мелодрама", "история"],
        "episodes": [
            {
                "video": "BAACAgIAAxkBAAIBfGlw5Lhjav0uOoZ59rVvU1Fb5_DvAAJPlgAC1HloSyT9FoCIwptWOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBfmlw5u7RSP9IeQgu5uF2uUDf84CbAAKglgAC1HloSygJ-copBnsROAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBgGlw5ww5QJWwoWo-mXfwjWE1EJU_AAKklgAC1HloS7AhME-0inwWOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBgmlw5yNuCJoYPtdBrvilXyXlHWsCAAKllgAC1HloSxHuloCaOKGqOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBhGlw50oWupU-A_ZzeFjP6o2Gxmg7AAKmlgAC1HloS_TYk6uIOVenOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBhmlw52PWX5TXt8ayKTaD1E-hHlufAAKnlgAC1HloS5w33gp8Qlm9OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBiGlw53NIeGBDh-S5xZQUejU_zlbUAAKplgAC1HloSyAuHscn9d43OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBimlw545TSCSrYiMaLoXm7lAcIGpgAAKslgAC1HloS4AYBSCdS-neOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBjGlw56ZZI_C1Ci1Ezh45S6vrHxWGAAKulgAC1HloS_h6mHMfqUSVOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBjmlw58MIqYnY9kcNwu5z5xv0iOs0AAKxlgAC1HloSw0fTjU0dQcSOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBkGlw59LIxTyW96N4kTRo_8uGjRhjAAL0lgAC1HloSw4_noMNvAIyOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBkmlw59_ralL7VDNqJZLN0ipCa15wAAL3lgAC1HloS_E0pdj-1_skOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBlGlw5_MpyqUPetAgeq2AX8i2ROT1AAL4lgAC1HloS_XLkt4IYodwOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBlmlw6AAB-huXtmo0-TID0-VYTE8XLAACApcAAtR5aEsxqo9Jqpwy7zgE",
            },
            {
                "video": "BAACAgIAAxkBAAIBmGlw6A59ix522hCqqGo__Acy8vSwAAL5lgAC1HloSzap2A_N-DQZOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBmmlw6BxS6cKknJVJo7hQrFnefAOrAAIGlwAC1HloSzEsS-hNOXMVOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBnGlw6C57bDhDIH__vKgz7-xnEScbAAIHlwAC1HloSzj4U44YyGAHOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBnmlw6GCaJLcBwvaiHcoWIxzmjV0lAAI1kwACxdNpSxNJ8aHiyFxmOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBoGlw6IoAAW-KCSUKMhRafQpPAiiaDgACP5MAAsXTaUud0eWXxxiqiTgE",
            },
            {
                "video": "BAACAgIAAxkBAAIBomlw6Jb2X7uPriUxxcVjhv5Ah1OdAAJOkQACxdNxSykHY-azQuFEOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBpGlw6KjuRTbbRanM2CmL4LKV8kJDAAKflAACxdNxS9MwZBVT3PHCOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBpmlw6LYhCYpqkzCH2RFj2ZmcyLRgAAKrlAACxdNxS6k2TDelSIXiOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBqGlw6MXcFllFOVWGZ3N6-NB1I_sfAAJTlgACxdNxS8Mo3N2KKZtaOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBqmlw6NauLDb7hPq60uudPULQn6JlAAJ1lgACxdNxS8EYNTW5gt8EOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBrGlw6O56N34MgklcB1m8fZeZ6VW8AAIllwACxdNxS4N8GNim5-hYOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBsGlw6We-eJPxZHHAAtufPILG26GtAAIylwACxdNxSx_RF1dYFCtLOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBsmlw6XSyKDlpHHAmYO4hq1S7WYLjAAJ5lwACxdNxS8systZS1KRROAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIBtGlw6YKHiVsjBY_akovseFz8JNM7AAL_jgACxdN5S8-1FwABZrq_uzgE",
            },
            {
                "video": "BAACAgIAAxkBAAIB9Glw9hC0_UyQih3OTix2ko3MbulpAAK5kwACONKIS858C-z8QQ5WOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIB9mlw9jGj3lIt6J8k8P0hGOKVej1hAALakwACONKIS9ldjKr2qg1bOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIB-Glw9j2Qu_KpfkX1I74Nsrqn2lzcAALokwACONKIS8N_bR1PinavOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIB-2lw9lC_CbuyySIzd1Gi3jX4edjkAAL3kwACONKIS9zWvNduAdU_OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIB_Wlw9mWXtx1Gb-qt3S-EsTiQljMDAAITlAACONKIS4m9JpR6kjY0OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIB_2lw9nI5qKpUvpIAARj65VFBi_ObaAACJ5QAAjjSiEskvT3WE56gUDgE",
            },
            {
                "video": "BAACAgIAAxkBAAICAWlw9oEg4-YJDqpVV3YQbVF-HohTAAIylAACONKIS7HYAnzPent7OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICA2lw9ov3CPcW9JD58zkH2bNoQw5ZAAI-lAACONKIS2m4IrYvqRgWOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICBWlw9p3WuYpLBOQRvSV80JgGjLAqAAJLlAACONKIS9FFE64VMRB8OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICB2lw9s2971OUiLJZe2In4QRWr1UwAAJWlAACONKIS7x3-A5BwMg7OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICCWlw9voAAalrXPj7o0sglnZUHyWJQwAC0ZQAAjjSiEvmffpanBtUHjgE",
            },
            {
                "video": "BAACAgIAAxkBAAICC2lw9wfGFlGN7ENBdXKn3q-iX3JEAALelAACONKIS-yW8h349M1sOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICDWlw-CaLWp5Wvthn5FGnSm6y1A16AAI4mQACONKIS_3zpK27VC3UOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICD2lw-DiCUUK9aiFoVCnDrVBbfYlZAAJNmQACONKISzRR9dtoYFhZOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICEWlw-GL_ZGPpQUOHL9dVN4iWk01JAAKCmQACONKIS70M5msLYGSwOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICJ2lw-jz43-spcujjKPFUhknyJR0OAAKbmQACONKIS1fGc7Xviv7-OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICKWlw-kq84D_LoA6FUNXWb_M2smRpAALKmQACONKISyGdbsf720lUOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIClWlxBh4Hc6v5G82AY3DhHXwbAl14AALkmQACONKISwYYoH5I_oWGOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICmGlxBmtbfDgHzEPmSN8wazV_peZ4AAL5mQACONKISzu1Rcq_-8u3OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICmmlxBnk1ij_ch9K92O7e4AtFFLZFAAIKmgACONKISx8UlmTCTh3YOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICnGlxBoe8g6pMfq-BMMV4FTQabQPQAAIamgACONKIS3WPRBaLgJAdOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICnmlxBpVI391iekanEXL7a-ZEWVhdAAIvmgACONKIS719ywoIKsYbOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICoGlxBqAgceQ2LSuPtAzpLxFia9ZYAAJFmgACONKIS_Ifr6qgoKlgOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIComlxBqvvJqsCNxkEQ0vwx09hzXo0AAJymgACONKISz_-8qkJKQ7UOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICpGlxBrjTYxAwKwSxscvx9vhlRLrnAAKDmgACONKIS8fcqgG-D5AvOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICpmlxBsORnyGqB88DW8pnQMKAdLfrAAKRmgACONKIS_9_jwdha1L5OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICqGlxBtccn1QKdnQAAe1gGeSevQAB0aQAArOaAAI40ohLSWgFowqLjPo4BA",
            },
            {
                "video": "BAACAgIAAxkBAAICqmlxBuVWxcLBpZFzPKbSfjOh0dpFAALgmgACONKIS0ytrnSv93cQOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICrGlxBvHuYchq4NQCh2utm6p_SvRbAAJ3kgACONKASzLkvykqReWiOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIC3GlxDdnlORplNEmg4FdLZK_JyP1kAAIvmwACONKIS4TchapaBxGjOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIC32lxED6S1WwapgifHSLclIjzwvOOAAJbmwACONKIS0LxOJ_go7R0OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIC4WlxEE1XVraGQ5bQkasYczJQq7pNAAJzmwACONKISxPFVDvfnnFxOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIC42lxEFn4372dp8h7q0Sn5OVHXwndAAKEmwACONKIS5HswGIi4I_KOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIC5WlxEGWSDjXfZkB4_h1MClP2EWmyAAKUmwACONKIS9Mvokr-XmYBOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIC52lxEHrYHdUXpcdINUWXzh-uxNwqAAKnmwACONKIS8HqCrJs9J7WOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIWF2mSBIfsHYjlp7yQeKj48bL04f7CAAItkAACT_54StgO2s9EqO--OgQ",
            },
            {
                "video": "BAACAgIAAxkBAAIWGWmSBOnQBddN9n8_0CeHqhb_7DAVAAKliwACc3HoSm2fAcLQPtr2OgQ",
            },
            {
                "video": "BAACAgIAAxkBAAID-mlyA5VHoCRnBAvYVN5ns9i68IgcAALmmwACONKISyWgBtKKVKDQOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAID_GlyA6FbcpTHfrZR6BIV7UVwvn5TAAL6mwACONKISxzvqtiLXUADOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAID_mlyA6wLPP73ydsVCObkfRXTwhZaAAILnAACONKIS9fe4_hT8i7jOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEAAFpcgO3hTF8uwZ3_ICMqN9Kr8jKJQACMZwAAjjSiEsyyNgnzJg6KzgE",
            },
            {
                "video": "BAACAgIAAxkBAAIEAmlyA8IAAWR8ydCkTEqRe_rLw0Fv8gACS5wAAjjSiEsN0tsJp1pdMjgE",
            },
            {
                "video": "BAACAgIAAxkBAAIEBGlyA87MCExB81XjDVKABupaqEUDAAJ0nAACONKIS9t_zObO6NlbOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEBmlyA9gkmU_nmQgTdPwsjk0VHiL3AAKTnAACONKIS5WYq97PNpAjOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIECGlyA-eZ0wcoElRdZnKnRRBH0FSbAAIangACONKISz-Kowt5ERJkOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIECmlyA_U-qP5gDWItXmaMHHq6AAFvygACy58AAjjSiEthJxVIOYDmmzgE",
            },
            {
                "video": "BAACAgIAAxkBAAIEDGlyBAJ3j7Vs5XuyonvWJDu8StgCAALQnwACONKISzHrGX0GivnwOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEDmlyBBCmrUgi-w6TpD4a8aivBSFCAALpnwACONKISz-hIxLokeD_OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEEGlyBB_LlQo6FGBefApTevL7XweOAAIQigACTp-RS1o1AXgWX6wfOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEEmlyBC5QIfWKyJIwjBF0CYxtbMAdAAIqigACTp-RS_SeLGfntiMtOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEFGlyBDpmVIjvF6YM00aLHvWgjnk2AALunwACONKIS2xHMJHI_oMnOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEFmlyBEqTNltMzTCs1t9Jr4zwAAGhKwAC758AAjjSiEuZxcZHOR_PojgE",
            },
            {
                "video": "BAACAgIAAxkBAAIEGGlyBFQDSmAAAdQzz3l6edZiyss1zgAC8Z8AAjjSiEtTR2XuRlFfkTgE",
            },
            {
                "video": "BAACAgIAAxkBAAIEGmlyBF-y3Uh2EuCVZqQpSLpv81mmAALynwACONKIS5V3cEFaTRLVOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEHWlyBG4ehbYnzAtOKEsMCMqBqfSBAALznwACONKIS6s-W_8-l4thOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEH2lyBHmsWrroLCbyMAkYVZXgce2BAAJAigACTp-RSx4c_12PdW-9OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEIWlyBIM9ol64T6WS7kJXF_Pb-QqMAAICigACTp-RSwwmJhtqURbrOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEI2lyBJCeOSIhJlzFmLoTy87pxdJ6AAJdigACTp-RS9y-vZex-QLYOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEJWlyBMfG5qbivsZgfwdkeYUTSJM4AAJligACTp-RS1MqUYhZw1IxOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEJ2lyBNIZPNOHNL6sVsqMumUv6ii-AAJsigACTp-RS4y9jMqYTRZROAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEKWlyBN4yY1k4L2GhCTMClpGhmkCKAAJ3igACTp-RSwtf9FpkPv3sOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEK2lyBOmzOx7KMPvX0d5v_bwZ7JkGAAJ_igACTp-RS39e06I8cdETOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIELWlyBPRuTU4Qq9FbYtkxz8Y-s1rfAAKHigACTp-RSznQAwWiWAhSOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEL2lyBP7YDhiKV1-q7kwT-4mRbDSHAAKRigACTp-RSyVBB1mktixjOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEMWlyBRLHgpohHRqBG9BQXlKsTD_3AAKeigACTp-RS_418qF8hM-qOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEM2lyBR3D0mh0sFU4IppvXkTk0psmAAKligACTp-RS-HGtANqQVd2OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIENWlyBSpVj2M8rr9AZSe7R4SZi0L0AAK7igACTp-RS1goMhdQVcw_OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEN2lyBTS94LUES6yoLDDRSXm5o6N7AALHigACTp-RS3zt5bBo_r4KOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEOWlyBVIEeG_XLNMvVHTIQFor30KdAALPigACTp-RS4kISnxU5Xq1OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEO2lyBWC4nXz47yovgYAqiV7s8ANeAALVigACTp-RS38GiSrIudJJOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEPWlyBWonWPQdGKQGd6RXavIFtD7YAALeigACTp-RS2zjGbl0yCzqOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEP2lyBXNMmSt7MjL7icEuThytcogzAALjigACTp-RS95qhX15_oYPOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEQWlyBXxsBVrT8hk64P8brd6U1konAALuigACTp-RS5mzfCw6xLs6OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEQ2lyBYX5qJkY3-58nvIVp92CAq39AAICiwACTp-RS1aRnkNr_-HkOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIERWlyBY8O8vXAaGN2v6-Ivtbn5K0lAAIYiwACTp-RSwrlh4_ewOWnOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIER2lyBaTdlGPjuHjBkUFyutjekjxQAAIjiwACTp-RS1uTlkKuJMqmOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIESWlyBa4Es3kDDhmd6Xy1Jz2zoIzhAAItiwACTp-RS1yWuMsNCFCjOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIES2lyBblFLpq7_GFMaTW0BtRFGlkWAAJKiwACTp-RS0uTHRwZeqn_OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIETWlyBcxvwfoOQXnxYrY0XN8gSOsvAAJTiwACTp-RS0_SvI_k8BeyOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIET2lyBdb9apapM4AQ142k5lTisaYEAAJciwACTp-RSxNdrdI-dc1JOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEUWlyBeAqhknaN06DtvOEmt5wqh9IAAJriwACTp-RSxipibdFnP5tOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEU2lyBeoYPQp8hJfE02yGwSYKPcWMAAIzjAACTp-RS_rGovo5pcQEOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEVWlyBfURnbd9ztirD2ccIhtyWmJhAAJFjAACTp-RS0fNMDokg8rXOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEgGlyPzT_V5umGhERFvjTxayuQxdGAAJkjAACTp-RSypD81HmYYbWOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEgmlyP0NfAafwX_kunydUqFIemqMDAAKRjAACTp-RS_IhwRWAdLDJOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEhGlyP0939lx6cogPLrFU-1bNdzZuAAKijAACTp-RS2CHvLKfMd47OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEhmlyP17AIPyWm6WEvgwuc9wnjf8cAAKbjQACTp-RS1raFejsDiVNOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEiWlyP2lz0gOvdBaTFf7EUthiEMdsAAKkjQACTp-RSw6Dhqvmhd83OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEi2lyP3VmJJHIvfthNTdFiP9XoLNLAAK3jQACTp-RS4ZLlYMiXOViOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEjWlyP4FDaTC3Xbd0ZrYEWUT3czRGAALTjQACTp-RS33FydLJPQpHOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEj2lyP46sFV6N2uZZQmIi6EnE6Qm9AALfjQACTp-RS4cvugABJUTvKDgE",
            },
            {
                "video": "BAACAgIAAxkBAAIEkWlyP5id9E2var26kC06Mjy9OpAyAAIFjgACTp-RS38nHBHHWEtLOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEk2lyP6V49jG9aEVo6fd8wEbivvCEAAIcjgACTp-RS4goHeMdoqmIOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIElWlyP7LKj5EI5FcXitU1BfnLFT5xAAIyjgACTp-RS98lqVGlImFHOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEl2lyP8D9dD8JL8WcDoRGk-jBi4P6AAJHjgACTp-RS463UEW8md67OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEmWlyP8w_t4Lqmy5OS5P5cct_HrXnAAJPjgACTp-RS9LSN83ohsMdOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIEm2lyP9gAARtYXARabryrUFTP-aV1LAACE5EAAk6fkUvswKnX0jXEhTgE",
            },
            {
                "video": "BAACAgIAAxkBAAIEnWlyP-UX4Aut_B5RCcmoG-DFmXAhAAJikAACTp-RSz-UIv8p9zbWOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFGmlyTu6ZgVEEqRVgmvHK9SRo-CrLAAItkQACTp-RS96sF7My6_1bOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFHGlyTvyI9PBYMVAjatk5PaN24bDsAAJIkQACTp-RS3-5-625VVWWOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFHmlyTwVNv5VOT2o1GuBJuCht6sA3AAJXkQACTp-RS6RZm5z3niyFOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFIGlyTxGgCMDkZ-Lnt8I4xSjBw-pnAAJlkQACTp-RS4wy_1gvB42nOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFImlyTxwNwWO0guLA9Mf9EfQH6ziwAAKlkQACTp-RS_azRWPRNFKhOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFJGlyTyakeo2ehNMDAag0h3aboPqRAALEkQACTp-RSw4Ju_u1-xahOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFJmlyTzvxmC_ArahbH-CeQyDzN9UoAALlkQACTp-RSyOBSiOnGVOxOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFKGlyT0VGt6uvUOmhmhp6l1uGshg0AAIBkgACTp-RS0G4ic1y3JTHOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFK2lyUB3EngVEBeXBHa6aJL6xo1P7AAIZkgACTp-RSwmaNhtAS94IOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFLWlyUEOfGcdg8JJzKXwF_EFE31PMAAIykgACTp-RS8SLNdD6x4vvOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFL2lyUGWuwHcCp5SiwbSLQux78FA_AAJYkgACTp-RS0GAasbFNF1JOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFMWlyUHLrwpZ33yJZL7-NLIWWxAWmAAJ9kgACTp-RS0cO92vNgWACOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFUWlyU3Sy0sqMvQABWDYoIqKpB79-wgACpZIAAk6fkUsyUFukoxVlhDgE",
            },
            
        ]
    },
    "030": {
        "title": "Великолепный век: империя Кёсем",
        "year": 2015,
        "episode_counter": "большинство серий длинные, у нас 88 серий",
        "description": "Спин-офф культового телесериала «Великолепный век». Сериал повествует о жизни Кёсем-султан — одной из самых известных и могущественных представительниц Османской империи.",
        "poster": "AgACAgIAAxkBAAIC-WlxTAR60GoMKlhimBdX4ZDy70X0AAJvDmsb3hGIS2HvCMOEpTeSAQADAgADeQADOAQ",
        "country": "Турция",
        "director": "Дурул Тайлан и др.",
        "genres": ["драма", "мелодрама", "история"],
        "episodes": [
            {
                "video": "BAACAgIAAxkBAAICE2lw-YhK9daN1o72jPxkG-tpuk1oAAJtlgAC1HloS4knn4OmythdOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICFWlw-Z8c5ML4SaXhMJsUdg6SiO41AAJ0lgAC1HloS3IzYxypqlNHOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICF2lw-bJeEmp6uJNhsI22vQfe-M3qAAJ6lgAC1HloSybBEVdzNrIdOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICGWlw-b-FBNyQ0mtp8_vIum4LEyo_AAJ-lgAC1HloS-NrqHQ3__64OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICG2lw-coXcKqnfHRxHoQxbsfehxCuAAKIlgAC1HloS_RxG0dxmJsyOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICHWlw-dYHa2y6lkmg0UJrJEVM3Ys7AAKJlgAC1HloS4twfPthUM_NOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICH2lw-e7yXQXGNV0ee3DILwiblSnMAAKUlgAC1HloS72meeyooNjDOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICIWlw-fv2lR30T-SvRk5usgeIfE12AAKXlgAC1HloS2BT_p0hd44EOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICI2lw-g7TrxYH-ZSEPriduG0mjyWfAAKZlgAC1HloS2MZ6UCgcIePOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAICJWlw-hm_VsJdPNbZpV23Z7fEudZpAAKflgAC1HloS6fiy6_fOX8GOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFM2lyUIzVHPBfOjzWiUh8AwNFNCmmAAL4kQACmliQS9E3Wqe5RgrNOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFNWlyUJed-vYFYUiwkBDXgzasNz3tAAL_kQACmliQS2IAAQiEiCfTCjgE",
            },
            {
                "video": "BAACAgIAAxkBAAIFN2lyULoE83lSE4PEP8ayx2Ny7-YhAAKhkgACmliQSymNMngrUC-LOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFOWlyUMTjsgGU4TPhi6UQ_k3ly3XdAALlkgACmliQS-pHvBIICVrvOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFO2lyUNPoBi7iCMD-VPfgwrvV4XHXAALvkgACmliQS7Ku10bMbiQiOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFPWlyUOhFTU7Qfjo5eiKF0unruD3hAAK7kgACmliQS0L1drHnuVb9OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFU2lyU4t5Yexgzyp-E5JFwYpVsT7LAAIRkwACmliQSzo0tpWi9twFOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFVWlyU5127E9I6smdAykGowjgAQUTAAIakwACmliQSwS1AAGQCTLJ_TgE",
            },
            {
                "video": "BAACAgIAAxkBAAIFV2lyU6vE7Gg4Zk5NnSY811drXMbbAAJPkwACmliQS4Qwp8TFe6loOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFcWlyWS8ONDplLoUSOqv5bLvqTXQQAALzkgACTp-RSx9fB0evHghjOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFc2lyWVDuqu3AxESFdwRyIKLNzHKfAAIkkwACTp-RS_ooLgZpfNmkOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIFd2lyWlI_HEqbjFSHp5GI5jqWB45fAAJCkwACTp-RS6NIku6_Hkh7OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGOWlynQ0aGUAjQ_3HYwIx-RQhd9-fAAJ2lAACTp-RS-3VZK47dBMcOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGO2lynuISlPBdErDvgI4exsCuGzxbAAJ6lAACTp-RSyi3-8uXnqW8OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGPWlynvTlKBUXSGz3N5o12yOf8l3vAAKFlAACTp-RS5t19wM9qn4GOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGP2lynxtbMa69kFRHl2tvR_WpRlvoAAKhlAACTp-RS__isoG-LAjjOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGQWlynyn_KEPZsu_AXNfMeQ53x_8dAAIllQACOr-RS4jypnCta1ctOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGQ2lynzbk7vrvOCUBYcCTqbRJW44_AAJAlQACOr-RS_Fn0JshOxK1OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGRWlyn0HbdV-Sk9p19GJsSg2Y4_9xAAIHhwACyu0pSI0d6OuGF-cOOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGR2lyn5-Fp6ExTDEpNpAsij0D6yyqAAJnlQACOr-RS69rNbBAA1M4OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGSWlyn6r6lEr6SKHy3i1LiE4LIyQBAAKJlQACOr-RS7ohmFb_MhnvOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGS2lyn7e3uzTnWPQqk4-xiZeVhbjYAAKalQACOr-RS7m_EgFsKoUxOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGTWlyn8PpQf2O076XJHy4TumveJTlAAK2lQACOr-RS7IHW-Sp8PiWOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGT2lyn87VIPi_5gJHP3kD6UWOxCUKAAL6lQACOr-RSxqOYs4faQpVOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGUWlyn9iWLYwtLLWbAkly8rHyYQPDAAISlgACOr-RS9ZHNpSkgC7bOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGU2lyn-MhrOmhw__zfP3H5TQ3VfHQAAIflgACOr-RS3lWdJZoxCAqOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGVWlyn-4zXt-QBHqLpSqbXA226Z4NAAK1hQACCIDYShObRUvJ-jgzOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGV2lyoBqUE68JA5zLt29oLBcwCigbAAIjlgACOr-RS4ZZVjCHfeRiOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGWWlyoFMZ33SBbqablhc8kY6Ks-BgAAIolgACOr-RSyr835fG3HTtOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGW2lyoGB8bYgy6g1rEGFULRr84wiuAAItlgACOr-RS2Q4wOiePoovOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGXWlyoGqkuJn3SM51FZ9v_YGpnGuxAAIxlgACOr-RS7onbK-r6dPROAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGX2lyoJndoXUukzRxjwNRN3emElrTAAJNlgACOr-RS-1KIuoEz-LnOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGYWlyoKnKLk6mQ9Mj9chavLpq3A7nAAJelgACOr-RSzXVgLAq1bkuOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGY2lyoLMDHWxEnUkNg8GOEIvaPNy4AAJnlgACOr-RSz2430A7z988OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGZWlyoMp-FLAiqYnq2Fko_XEeAfrcAAJtlgACOr-RS9OY6-OQdOUvOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGZ2lyoOQXMJoHUZNHosZXsE-fJuR3AAKElgACOr-RS2YZ5_b1Bt7kOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGaWlyoO7aE9vcA-v3AmAfRYFS3yQhAAKelgACOr-RS3YoRgN1EpkaOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGa2lyoPmpilNv1525US7GSxOm37v9AAKwlgACOr-RS5o2Mcx6GwwzOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGbWlyoQKvnkDcqMbnpewAAV9IhmEizAACv5YAAjq_kUtwWWh_RhQUQjgE",
            },
            {
                "video": "BAACAgIAAxkBAAIGb2lyoQ4xKtKFSUSRNZl4Ld_-sayGAALRlgACOr-RS-6qZe8KPNJSOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGcWlyoR3mXZhpBDFPbT9C9PGgkKrzAALplgACOr-RS--_g8rtSFQQOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGc2lyoSjzXGAMRxzMkzyhZSGow5c8AALxlgACOr-RS2y1lb1-oHhCOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGdWlyoTPeYTvBbIlYAel_oyCa7JJXAAKolQACTp-RS5Y0j2qBzFa2OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGd2lyoT022uvZeEJ_j2sGM1iBm-QYAAKulQACTp-RS8OyVV2EXzXnOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGeWlyoUj8tu3bzthUZdgFIeqS2Om0AAKxlQACTp-RSzIh1dW8IHNWOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGe2lyoVLROa7Wjl39Fbgh7xjhryj-AAL7lgACOr-RS9joX2QStCgOOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGfWlyoVqUKHV3ktNok_1Qkb7QPZazAAIDlwACOr-RS-OPVjQuS-aLOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGf2lyoWVy8cqGYKQlmZ3p9gtmvgF0AALAlQACTp-RS9b--GpWCdO3OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGgWlyoW4e8FlrmO3PtmIU-GnXg3DEAALtlQACTp-RS4nEcpipoSbaOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGg2lyoXgP4N5GlZLjC25C5OWxMmYCAAOWAAJOn5FL3ZWI2xVCmwQ4BA",
            },
            {
                "video": "BAACAgIAAxkBAAIGhWlyoZAP91DmCu0oFXmpgdniQyuYAAIQlgACTp-RS_eMzVbbxV_XOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGh2lyoazYfMAtkeIkQ35S2ewf_qa4AAIUlwACOr-RS-oLZAABFV5RyTgE",
            },
            {
                "video": "BAACAgIAAxkBAAIGiWlyocD0pZowXRyWGBNwS2DMhUVJAAIjlwACOr-RS0pfmSiEpw7eOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGi2lyocrRnlMf6wGuk5zK5zG6ZEF9AALSmgACEU9hSa5YBaZL7UUwOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGjWlyoegP6j87LqrFWctUIQtOn8C7AAIrlwACOr-RS9Cn81H9_38zOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGj2lyofJf77nvUQm70e2u7t13Ttl0AAI0lgACTp-RS2vFUut4hqNVOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGkWlyofyIvxzrnucppnJ0t8jO-pq1AAIilgACTp-RSzRGh8yWd4eNOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGk2lyogR2ZHDZL2_9yZcStBwEXdGjAAI2lwACOr-RS87_Pxh4wVU7OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGlWlyogsTyLBjdnTIM3clMdL0ioMPAAI3lwACOr-RS8S0vJePZr8QOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGl2lyohL7uXr_1BmcZP0xSGrH_4iXAAI5lwACOr-RS8cO2GfasfhtOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGmWlyoiSO641TYSTlPSvUacTi_EcTAAIblgACTp-RS1496IUuZRw_OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGm2lyojD1cjW1JeLYeY0_fdkHjMPlAAI-lgACTp-RS0ThbyJfAAH80DgE",
            },
            {
                "video": "BAACAgIAAxkBAAIGnWlyolRAjbQkQe8ZmRkrEmufXo_EAAJOlgACTp-RSxnDcvvgvwGkOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGn2lyomBEutPzBgsEaX4BCT8TBhs7AAJelgACTp-RS0dmgznnZBTTOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGoWlyomyiosZZe_E8OhhOQDOww2pYAAJglgACTp-RS7iY_z3ls1ITOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGo2lyonpEd0ls5D2bh2SbK8XG79AFAAI9lwACOr-RS3dSH5vS3gEmOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGpWlyooOpiD65ENMxdfP9_aILoKPMAAJ7lgACTp-RS5LEorMEv5m1OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGp2lyooxwDjtEE2jUOn1tCiXhgRIjAAKElgACTp-RS-xwY76HQ_O9OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGqWlyopUH5a3sQNCSNE5dvkdB51i3AAKilgACTp-RSzSJSrV73r52OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGq2lyop2o37UgthQiRrRj7rrBLMA-AAKolgACTp-RSxCxXPbzr6lGOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGrWlyoqUSuhV823lUiIAUgx4AAfp3BAACR5cAAjq_kUth36_xroqEJTgE",
            },
            {
                "video": "BAACAgIAAxkBAAIGr2lyoq6GEbcr3RkDbt1Cv0D1tw5RAALClgACTp-RS6TOIE5eUMEfOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGsWlyorbQHY8QfrPTu0yaergSA6zoAALNlgACTp-RS7rRre7vzwTjOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGs2lyosE6jcBk0UixQlSNBOm-VwcRAALmlgACTp-RS6hQt4kyrWJnOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGtWlyosxY59x_0obbaysQiOhExiaUAALslgACTp-RSzr3vPlsmpRFOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGt2lyotkPl0K4V1-fyVX9ZUUo0ceuAAI_lwACOr-RSxV4K0FJpqRSOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGuWlyoubXZO_nMP_Sqs1pzB3UWdJEAALulgACTp-RS0P3iQZ9GRoSOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIGu2lyovBtPaQTGKswBpUnlXE4v9bsAALylgACTp-RS65EGkn9Pu28OAQ",
            },
        ]
    },
    "057": {
        "title": "Леди-баг и супер-кот",
        "year": 2015,
        "episode_counter": "онгоинг",
        "description": "С виду обычные старшеклассники Эдриан и Маринетт при малейшей угрозе Парижу становятся Леди Баг и Супер-котом. Их миссия — захватить акум (тёмных бабочек), которые превращают людей в суперзлодеев. Когда супергерои объединяются, оба не знают истинной личности другого. Маринетт не знает, что Супер-кот на самом деле Эдриан — парень, в которого она тайно влюблена, а Эдриан, чьё сердце бьётся ради Леди Баг, не знает, что под маской супергероини скрывается милая и ветреная одноклассница.",
        "poster": "AgACAgIAAxkBAAIMfWmAwIVTrgbSw1pOM45l2xz8iiosAAJ9C2sb3m0ISP_GjKaUE7RVAQADAgADeAADOAQ",
        "country": "Франция",
        "director": "Томас Астрюк",
        "genres": ["мультфильм", "фантастика", "семейный"],
        "seasons": {
            1: {
                "title" : "Сезон 1",
                "episodes": [
                    {
                        "title": "Непогода",
                        "video": "BAACAgIAAxkBAAIMf2mAxiLDacrsbUWQM14owvU28AuNAAONAALebQhIGkLQiQTUPts4BA",
                    },
                    {
                        "title": "Злолюстратор",
                        "video": "BAACAgIAAxkBAAIMgWmAxl7P2CYLyWP5OW3x5Yjk68kBAAIJjQAC3m0ISGyKqp5ZrncCOAQ",
                    },
                    {
                        "title": "Леди Вай-Фай",
                        "video": "BAACAgIAAxkBAAIMg2mAxr5ETKLDk4K0WyqtLv95ckvUAAISjQAC3m0ISIYPg73pdCpyOAQ",
                    },
                    {
                        "title": "Принцесса ароматов",
                        "video": "BAACAgIAAxkBAAIMhWmAxvYakziO9RdzSZdqTMxvkt7hAAIYjQAC3m0ISIXbHXreJNWeOAQ",
                    },
                    {
                        "title": "Злой купидон",
                        "video": "BAACAgIAAxkBAAIMh2mAxz0JFFV1ZEI_t1fWttTWyTnUAAIcjQAC3m0ISAmg8ehgYMoxOAQ",
                    },
                    {
                        "title": "Месье Голубь",
                        "video": "BAACAgIAAxkBAAIMiWmAx47eajVj1w_55PyDCv9by530AAIhjQAC3m0ISL4AAdLRfCFDqTgE",
                    },
                    {
                        "title": "Пикселятор",
                        "video": "BAACAgIAAxkBAAIMi2mAx8aJKh9D410uy5a2ioDeZQKlAAImjQAC3m0ISIu6KidxHxgeOAQ",
                    },
                    {
                        "title": "Двойник",
                        "video": "BAACAgIAAxkBAAIMjWmAx_xBIS3zotxFzXXEmTyUCyFRAAIsjQAC3m0ISHkVoB_sBlnwOAQ",
                    },
                    {
                        "title": "Пузырь",
                        "video": "BAACAgIAAxkBAAIMj2mAyFfJEIpZrxMngbeaTcwWHWoHAAI5jQAC3m0ISIolEnRLKOmIOAQ",
                    },
                    {
                        "title": "Гипнотизёр",
                        "video": "BAACAgIAAxkBAAIMkWmAyJbCCvkk60vT3X6_aQvTm9TyAAJBjQAC3m0ISPLUvHrWnIdpOAQ",
                    },
                    {
                        "title": "Роджер-коп",
                        "video": "BAACAgIAAxkBAAIMk2mAyNmdyxnGBJ3N3rd9XsiN5LjaAAJJjQAC3m0ISBSrfUAefydiOAQ",
                    },
                    {
                        "title": "Игрок",
                        "video": "BAACAgIAAxkBAAIMlWmAyRGiqMmowY0Lalr47hT1DJ5pAAJPjQAC3m0ISFDWgl_z4ZCnOAQ",
                    },
                    {
                        "title": "Зверочеловек",
                        "video": "BAACAgIAAxkBAAIMs2mAzeg73n9kilj3kYfC9UyYmAmgAALDjQAC3m0ISDuyT-gkMRjPOAQ",
                    },
                    {
                        "title": "Тёмный рыцарь",
                        "video": "BAACAgIAAxkBAAIMl2mAyZjRn35sXDGsDM5AplWMNW5mAAJZjQAC3m0ISKdRkAtTrrj9OAQ",
                    },
                    {
                        "title": "Фараон",
                        "video": "BAACAgIAAxkBAAIMmWmAydaj1r6pfYuFk7bEifZHHIsyAAJijQAC3m0ISHKMKpdrvxdhOAQ",
                    },
                    {
                        "title": "Повелительница времени",
                        "video": "BAACAgIAAxkBAAIMm2mAyhaF393--d245_lKuhjl2XQDAAJljQAC3m0ISHzHBFxDR9oZOAQ",
                    },
                    {
                        "title": "Страшила",
                        "video": "BAACAgIAAxkBAAIMnWmAylG39RJF6fcnSs2vE4NXLT4fAAJujQAC3m0ISCl56FUVoZ68OAQ",
                    },
                    {
                        "title": "Кукловод",
                        "video": "BAACAgIAAxkBAAIMoWmAyqZP4oio9cHvHGFWwgQ5CM8_AAJ1jQAC3m0ISOorihYeq8SvOAQ",
                    },
                    {
                        "title": "Мим",
                        "video": "BAACAgIAAxkBAAIMo2mAyt_QWyWDidPnNlXWVuzcKOuBAAJ7jQAC3m0ISM3JFIrrWQLSOAQ",
                    },
                    {
                        "title": "Злодей-гитарист",
                        "video": "BAACAgIAAxkBAAIMpWmAyx-NMpHt9BFt4Da5mBp49E_1AAKBjQAC3m0ISDbOWnPhrQqWOAQ",
                    },
                    {
                        "title": "Рефлекта",
                        "video": "BAACAgIAAxkBAAIMp2mAy1wEB3UrM27NxW3ukbeDT2twAAKEjQAC3m0ISFJf3ttwOzT5OAQ",
                    },
                    {
                        "title": "Каменное сердце, часть 1",
                        "video": "BAACAgIAAxkBAAIMqWmAy7Pd-El4TiZusMpVNvMQp6BgAAKRjQAC3m0ISKeYCxv_edJZOAQ",
                    },
                    {
                        "title": "Каменное сердце, часть 2",
                        "video": "BAACAgIAAxkBAAIMq2mAzRHw09uitKwNag9iKVIzRRUhAAKvjQAC3m0ISHnm5rB63g18OAQ",
                    },
                    {
                        "title": "АнтиБаг",
                        "video": "BAACAgIAAxkBAAIMrWmAzUY7ja7yMbnABRDv__g0EDHpAAK1jQAC3m0ISOfeUmSaZG5oOAQ",
                    },
                    {
                        "title": "Кунг-Фуд",
                        "video": "BAACAgIAAxkBAAIMr2mAzXrMvzKzCxIUmRdo8CTGSfIfAAK4jQAC3m0ISIVtEKFFivUpOAQ",
                    },
                    {
                        "title": "Вольпина",
                        "video": "BAACAgIAAxkBAAIMsWmAzbB60nWX3H-Td915yh3lQmi3AAK_jQAC3m0ISA36QxWT6k_NOAQ",
                    },
                ]
            },
            2: {
                "title" : "Сезон 2",
                "episodes": [
                    {
                        "title": "Собиратель",
                        "video": "BAACAgIAAxkBAAIM8mmCccLB3LMsSYjQo8XYjcd5XagJAAJUjwACYFYYSLeRPagRAAF0MzgE",
                    },
                    {
                        "title": "Королева прайм-тайма",
                        "video": "BAACAgIAAxkBAAIM9GmCcfSuVjrq2SPjehOWnujug2_qAAJVjwACYFYYSHlt4BtFhIaBOAQ",
                    },
                    {
                        "title": "Лединатор",
                        "video": "BAACAgIAAxkBAAIM9mmCciVlrka5yKzFrZaf8xsQw0qUAAJWjwACYFYYSHHyBcylaIHROAQ",
                    },
                    {
                        "title": "Гневный мишка",
                        "video": "BAACAgIAAxkBAAIM-GmCclWZAAFT2fUavzxz3Nf1rk6_iAACV48AAmBWGEhqIzYbty60tzgE",
                    },
                    {
                        "title": "Бунтарка",
                        "video": "BAACAgIAAxkBAAIM-mmCcoKvDuaHJ7Tzj5AL0VlIHS2cAAJZjwACYFYYSOvwuhxjacxkOAQ",
                    },
                    {
                        "title": "Гигантиан",
                        "video": "BAACAgIAAxkBAAIM_GmCcrK8CBzMOAnm8elZtzhXJLTYAAJajwACYFYYSISjWb-130CgOAQ",
                    },
                    {
                        "title": "Укол",
                        "video": "BAACAgIAAxkBAAIM_mmCcuI0jwGBO6q9TBt19PQv4eocAAJbjwACYFYYSCITwU5ErGlAOAQ",
                    },
                    {
                        "title": "Бефана",
                        "video": "BAACAgIAAxkBAAINAAFpgnMU3nYbSUgHyTe17vqfisq2PwACXY8AAmBWGEimqpvDeLKIajgE",
                    },
                    {
                        "title": "Соловей",
                        "video": "BAACAgIAAxkBAAINAmmCc0abiz1WS5oLmubqXMxlZh60AAJfjwACYFYYSL09gvOe7HkBOAQ",
                    },
                    {
                        "title": "Горизилла",
                        "video": "BAACAgIAAxkBAAINBGmCc3l7RQmSskHWurspsxSZD2KLAAJhjwACYFYYSO9ENUuGySd6OAQ",
                    },
                    {
                        "title": "Робостус",
                        "video": "BAACAgIAAxkBAAINBmmCc6tqMV17KG42YcnBTXlawWXtAAJijwACYFYYSKKYZemIj2s-OAQ",
                    },
                    {
                        "title": "Сапотисы",
                        "video": "BAACAgIAAxkBAAINCGmCc9lzVzT8lYsKN-TpDZjX3E31AAJjjwACYFYYSHhbpviF4_6UOAQ",
                    },
                    {
                        "title": "Филин",
                        "video": "BAACAgIAAxkBAAINCmmCdAv1LtwQrHwGB8JnBUj-NebsAAJmjwACYFYYSPjjcJRfMrYEOAQ",
                    },
                    {
                        "title": "Сирена",
                        "video": "BAACAgIAAxkBAAINDGmCdD3Bq-dOei_Sgnh-5VjCFaCQAAJnjwACYFYYSEr5_980reMwOAQ",
                    },
                    {
                        "title": "Зомбизу",
                        "video": "BAACAgIAAxkBAAINDmmCdGsjKgX2vyV0pURRqYUr8XpeAAJojwACYFYYSKOST6QTvqv1OAQ",
                    },
                    {
                        "title": "Капитан хардрок",
                        "video": "BAACAgIAAxkBAAINEGmCdJ3ciGXoQK2UpOtwJfSMKh9JAAJqjwACYFYYSIMkE-0WqNcEOAQ",
                    },
                    {
                        "title": "Мороз",
                        "video": "BAACAgIAAxkBAAINEmmCdNFC5bUV5H-iGWT11OYn2VDpAAJrjwACYFYYSD2Ubm-Vt49lOAQ",
                    },
                    {
                        "title": "Королева стиля",
                        "video": "BAACAgIAAxkBAAINFmmCdTmsuS9kUjn8efAl22QJDm5RAAJwjwACYFYYSMqTr5wOx0n5OAQ",
                    },
                    {
                        "title": "Королева ос",
                        "video": "BAACAgIAAxkBAAINFGmCdQfUCXoUtAQo3ruHZpzzPRH2AAJsjwACYFYYSDiL6zAvm-1iOAQ",
                    },
                    {
                        "title": "Обратитель",
                        "video": "BAACAgIAAxkBAAINGGmCdWZoGOdfNvGoaNhVR4MqEm-6AAJxjwACYFYYSAgaZdt5nNibOAQ",
                    },
                    {
                        "title": "Ананси",
                        "video": "BAACAgIAAxkBAAINGmmCdZchlwpH22wJpgPzKHV0fZ1sAAJyjwACYFYYSENRYmexZnstOAQ",
                    },
                    {
                        "title": "Маледиктатор",
                        "video": "BAACAgIAAxkBAAINHGmCdci1A6WHzGbOVlZjrpVW6JC1AAJ0jwACYFYYSFqV9GX8i4pIOAQ",
                    },
                    {
                        "title": "Сеятель",
                        "video": "BAACAgIAAxkBAAINHmmCdfr5d6tO5sMGjU4pz4sAAcV37QACdo8AAmBWGEj7PeTnPXQH2DgE",
                    },
                    {
                        "title": "Катализатор",
                        "video": "BAACAgIAAxkBAAINIGmCdi9FAAHN3R_WtA0cPbmjm_PS7QACeI8AAmBWGEgk68FZDf0MMjgE",
                    },
                    {
                        "title": "Маюра",
                        "video": "BAACAgIAAxkBAAINImmCdmaE2UsdezRyHuFnGHMlzeTdAAJ7jwACYFYYSCXTnIbQcfsWOAQ",
                    },
                    {
                        "title": "Санта с когтями",
                        "video": "BAACAgIAAxkBAAINJGmCdqDYfBwuLf019U0ulup0dxiTAAKAjwACYFYYSBpGRBHoyVYuOAQ",
                    },
                ]
            },
            3: {
                "title" : "Сезон 3",
                "episodes": [
                    {
                        "title": "Хамелеон",
                        "video": "BAACAgIAAxkBAAINSGmDJqkObtwIYy2omseCh51H1UXnAAJ0lgACYFYYSARGwBiBYkUFOAQ",
                    },
                    {
                        "title": "Анимаэстро",
                        "video": "BAACAgIAAxkBAAINSmmDJtzrHhuRFFp6iApkL8iKwCfzAAJ8lgACYFYYSHpdodvwbWIkOAQ",
                    },
                    {
                        "title": "Пекарикс",
                        "video": "BAACAgIAAxkBAAINTGmDJzLpPTyXghxM_kuF8V5sXvcPAAKClgACYFYYSO5yhvbGs-RkOAQ",
                    },
                    {
                        "title": "Обратительница",
                        "video": "BAACAgIAAxkBAAINVWmDJ4l7HIcKFp1iIHSuMsRxCjKOAAKIlgACYFYYSE2R5hQUTFGJOAQ",
                    },
                    {
                        "title": "Рефлекдолл",
                        "video": "BAACAgIAAxkBAAINWWmDJ-FmECLL9qkZvtsWymVPWe9GAAKYlgACYFYYSLbRNKXTOvvxOAQ",
                    },
                    {
                        "title": "Оборотень",
                        "video": "BAACAgIAAxkBAAINW2mDKDeJJh_LydM6ikkChGZI5h4FAAKklgACYFYYSBntnDS-EwILOAQ",
                    },
                    {
                        "title": "Глушитель",
                        "video": "BAACAgIAAxkBAAINXWmDKI1tukOU8TTgPHX-4exmDZHkAAKwlgACYFYYSOoE04vqCe8yOAQ",
                    },
                    {
                        "title": "Они-Чан",
                        "video": "BAACAgIAAxkBAAINX2mDKOL766MmOj8jwHVenUvQRPk5AAK5lgACYFYYSPOKbnMLgYFOOAQ",
                    },
                    {
                        "title": "Талисманка",
                        "video": "BAACAgIAAxkBAAINYWmDKTjcL6zjNeicr5rO5eNt5ZqwAAK_lgACYFYYSIYT1gEMUDYWOAQ",
                    },
                    {
                        "title": "Обливио",
                        "video": "BAACAgIAAxkBAAINY2mDKY4sx-J6rY2e-0AeNFkgkogOAALBlgACYFYYSNGoXOek7rx1OAQ",
                    },
                    {
                        "title": "Десперада",
                        "video": "BAACAgIAAxkBAAINZWmDKeQzAWH-L6uG2IhoIvBVd28VAALLlgACYFYYSIZXenzov59TOAQ",
                    },
                    {
                        "title": "Крис Мастер",
                        "video": "BAACAgIAAxkBAAINZ2mDKjqcFJDsBSQPkF440w-WxTdjAALTlgACYFYYSIMPhNiUrKizOAQ",
                    },
                    {
                        "title": "Стартрейн",
                        "video": "BAACAgIAAxkBAAINaWmDKm9WEcfSdZNXXG3qr7IzrOVvAALalgACYFYYSMVGfDru1F2eOAQ",
                    },
                    {
                        "title": "Охотница за квами",
                        "video": "BAACAgIAAxkBAAINa2mDKsTL1oMPydnGF51oDt3uX-haAALhlgACYFYYSAaFDXbJTR-kOAQ",
                    },
                    {
                        "title": "Пожиратель",
                        "video": "BAACAgIAAxkBAAINbWmDKvUt-0l0LHQ4_BKBqcOk0lD0AALplgACYFYYSK5qxkGjdukaOAQ",
                    },
                    {
                        "title": "Игрок 2.0",
                        "video": "BAACAgIAAxkBAAINb2mDK0ufycaoiHgl8UEpgsRyzZcEAAL2lgACYFYYSP2wlacgyF2sOAQ",
                    },
                    {
                        "title": "Непогода 2",
                        "video": "BAACAgIAAxkBAAINcWmDK31FFzL1IafHHpocbzgMsx2yAAL_lgACYFYYSNegO5VrUKXdOAQ",
                    },
                    {
                        "title": "Икари Годзен",
                        "video": "BAACAgIAAxkBAAINc2mDK6zgvzMaXnfZU51b0ZaagZ_0AAIBlwACYFYYSHXSY-1u1uZ2OAQ",
                    },
                    {
                        "title": "Таймтэггер",
                        "video": "BAACAgIAAxkBAAINg2mDMTwWddINdQzfOHugKfsxjpbiAAKPlwACYFYYSN2JyQi3djaWOAQ",
                    },
                    {
                        "title": "Незваный гость",
                        "video": "BAACAgIAAxkBAAINdWmDLDFVkx410kml3UKrRQYrfI1jAAIQlwACYFYYSOzWkfunSkNeOAQ",
                    },
                    {
                        "title": "Кукловод 2",
                        "video": "BAACAgIAAxkBAAINd2mDLIejDzg_F2CIs48ax364ETr0AAIdlwACYFYYSIDv4qv7CmFROAQ",
                    },
                    {
                        "title": "Белый кот",
                        "video": "BAACAgIAAxkBAAINeWmDLN1Ap6D09xgM4zoBJltubGc1AAIilwACYFYYSAf50Rrs594-OAQ",
                    },
                    {
                        "title": "Феликс",
                        "video": "BAACAgIAAxkBAAINe2mDLTUVkgABECB52jg20KdcHdBYTgACMJcAAmBWGEit-u0R7TGM6DgE",
                    },
                    {
                        "title": "Леди Баг",
                        "video": "BAACAgIAAxkBAAINfWmDLYpAuHmtcFv45l6agB33QcqFAAI7lwACYFYYSM7vxX4aF4I0OAQ",
                    },
                    {
                        "title": "Сердцеед (Битва талисманов. Часть 1)",
                        "video": "BAACAgIAAxkBAAINf2mDLbzdxqp1kHZPXC0MnEd2J3sbAAI_lwACYFYYSLAaFK2lDwOjOAQ",
                    },
                    {
                        "title": "Королева талисманов (Битва талисманов. Часть 2)",
                        "video": "BAACAgIAAxkBAAINgWmDLexcSBh2XDqgKF_cWnDwZH9kAAJGlwACYFYYSO_XODWeSGV7OAQ",
                    },
                    
                ]
            },
            4: {
                "title" : "Сезон 4",
                "episodes": [
                    {
                        "title": "Правда",
                        "video": "BAACAgIAAxkBAAINummDT6cCJZbDqLWw-JWaVyZPzMawAAKRlgACYFYgSPINmq4Z_OEEOAQ",
                    },
                    {
                        "title": "Ложь",
                        "video": "BAACAgIAAxkBAAINvGmDUFdyWENW0bRC0WsAAcNNCr94wwACnZYAAmBWIEgAAZjAyjMceys4BA",
                    },
                    {
                        "title": "Банда Тайн",
                        "video": "BAACAgIAAxkBAAINvmmDUQh-ltHIDjvIDYkWWxMjvFC8AAKmlgACYFYgSPBk4xZdycTSOAQ",
                    },
                    {
                        "title": "Месье Голубь 72",
                        "video": "BAACAgIAAxkBAAINwGmDUcAuahWvKSdheCWhUlwCq_8kAAK3lgACYFYgSKJhVNhgGnlFOAQ",
                    },
                    {
                        "title": "Псикомик",
                        "video": "BAACAgIAAxkBAAINymmDUnVqi8FDFVkM7PPfPxLeQ26iAAK_lgACYFYgSCcrGZVbaOwVOAQ",
                    },
                    {
                        "title": "Разъярённый Фу",
                        "video": "BAACAgIAAxkBAAINzGmDUyQAAUtsZFWoe-nZVgeJ3oWZUQAC1JYAAmBWIEhjdCy1W92UKjgE",
                    },
                    {
                        "title": "Палач душ",
                        "video": "BAACAgIAAxkBAAINzmmDU9WksMeUqYKCG7NXFRUw9weiAALglgACYFYgSIjRQduckEb_OAQ",
                    },
                    {
                        "title": "Леди Банана",
                        "video": "BAACAgIAAxkBAAIN1WmDVIakSQKxhUAZ4HQBIDhH3iDEAALtlgACYFYgSPR9AAHH-uqxjTgE",
                    },
                    {
                        "title": "Габриель Агрест",
                        "video": "BAACAgIAAxkBAAIN3GmDVTifAmup_xoVVAxddcE5trh7AAL1lgACYFYgSCuN14CgUWV_OAQ",
                    },
                    {
                        "title": "Мегапиявка",
                        "video": "BAACAgIAAxkBAAIN3mmDVejJ7nKVqG07ZkFa4qXkj50YAAIHlwACYFYgSJoqMwQGDliLOAQ",
                    },
                    {
                        "title": "Вина",
                        "video": "BAACAgIAAxkBAAIN4GmDVph_OTJd6He5lykgP33fu84CAAIQlwACYFYgSCtQH-Mrn-6iOAQ",
                    },
                    {
                        "title": "Крокодоэль",
                        "video": "BAACAgIAAxkBAAIN4mmDV0qH3zJw8k9ufs3UuypjxfHeAAIblwACYFYgSOlQZQ1Bx_qrOAQ",
                    },
                    {
                        "title": "Оптигами",
                        "video": "BAACAgIAAxkBAAIN5GmDV_saVE3O6K9F6936s5ed6tAMAAIulwACYFYgSBtQMj_Witk8OAQ",
                    },
                    {
                        "title": "Сенсопузырь",
                        "video": "BAACAgIAAxkBAAIN5mmDWMFwDnv-hlXd4UrVrcRmbN9JAAI3lwACYFYgSPDu9Q7khm72OAQ",
                    },
                    {
                        "title": "Лединатор 2",
                        "video": "BAACAgIAAxkBAAIN6GmDWXcOPmlp_tRz9zzpKMT-IiyfAAJAlwACYFYgSOmmqxvoYxiUOAQ",
                    },
                    {
                        "title": "Хак-Сан",
                        "video": "BAACAgIAAxkBAAIN6mmDWi7Si2C4RZcvo0MRY_StTpkcAAJSlwACYFYgSImNCi6dtM8OOAQ",
                    },
                    {
                        "title": "Плакса",
                        "video": "BAACAgIAAxkBAAIN7GmDWt884Arz3AvaY8z6necDm1meAAJelwACYFYgSPoHdfymqkpIOAQ",
                    },
                    {
                        "title": "Мечтатель",
                        "video": "BAACAgIAAxkBAAIN7mmDW5KFhoN5iiGul01tmMqgxl6qAAJmlwACYFYgSPF0Ps3TCEJtOAQ",
                    },
                    {
                        "title": "Простак",
                        "video": "BAACAgIAAxkBAAIN8GmDXESefIwVsI5YQRilb73n2ok3AAJplwACYFYgSK7hFgFhZ3fwOAQ",
                    },
                    {
                        "title": "Цилинь",
                        "video": "BAACAgIAAxkBAAIN8mmDXPb2qX9P0x3xF0DAXphEcyWoAAJzlwACYFYgSCjTYDzl5lqlOAQ",
                    },
                    {
                        "title": "Дорогая семья",
                        "video": "BAACAgIAAxkBAAIN9GmDXaa91rOZ6paUW058c0oYUjiiAAKDlwACYFYgSOh-YCZ5ZvvQOAQ",
                    },
                    {
                        "title": "Эфемер",
                        "video": "BAACAgIAAxkBAAIN9mmDXl77CAtOgclqunRhGl0AAY7apwACkpcAAmBWIEhNLEqTQoPCfjgE",
                    },
                    {
                        "title": "Куро Неко",
                        "video": "BAACAgIAAxkBAAIN-GmDXxGwFpMj6IZvW5K8k4Wdho8-AAKolwACYFYgSOoJZSlWyIEVOAQ",
                    },
                    {
                        "title": "Команда Пенальти",
                        "video": "BAACAgIAAxkBAAIN-mmDX8KKh4N8Ylq_tLTEnOAuMcOzAALClwACYFYgSExg0yGzFrsBOAQ",
                    },
                    {
                        "title": "Риск (Последняя атака Мотылька. Часть 1)",
                        "video": "BAACAgIAAxkBAAIOBWmDacZDUCIatKl34f_gSfVrCp9KAAKgmAACYFYgSBWXRoFewF38OAQ",
                    },
                    {
                        "title": "Ответный удар (Последняя атака Мотылька. Часть 2)",
                        "video": "BAACAgIAAxkBAAIOB2mDanrQudhscoIcmYGEmm2ldav4AAK9mAACYFYgSLJqf18p9fR2OAQ",
                    },
                    
                ]
            },
            5: {
                "title" : "Сезон 5",
                "episodes": [
                    {
                        "title": "Эволюция",
                        "video": "BAACAgIAAxkBAAIOEGmDdq-BdnA0URIfdy_xnzRm9p7wAAITmgACYFYgSEb7xnLoBaWOOAQ",
                    },
                    {
                        "title": "Умножение",
                        "video": "BAACAgIAAxkBAAIOEmmDdvg0gx_LbEVcSIOOWHD2wTKvAAIdmgACYFYgSNrtc4HLAXXHOAQ",
                    },
                    {
                        "title": "Разрушение",
                        "video": "BAACAgIAAxkBAAIOFGmDdz_8Z0PTxtaiuZuF6bE3KaW0AAIjmgACYFYgSJK9s4vEGdLyOAQ",
                    },
                    {
                        "title": "Ликование",
                        "video": "BAACAgIAAxkBAAIOFmmDd4cUu0fs9uWY0zqcpMWz0uFHAAInmgACYFYgSBz4Z0k91kg9OAQ",
                    },
                    {
                        "title": "Иллюзия",
                        "video": "BAACAgIAAxkBAAIOGGmDd9L2xbOWSJ9YRAa84uoL8LKSAAIzmgACYFYgSOx8jSq2O0YjOAQ",
                    },
                    {
                        "title": "Решимость",
                        "video": "BAACAgIAAxkBAAIOGmmDeBtY8JE9wrw-lTolYubJ4vwoAAI5mgACYFYgSGbm8_5KZU02OAQ",
                    },
                    {
                        "title": "Страсть",
                        "video": "BAACAgIAAxkBAAIOHGmDeGVuutiBFUuzvN1zRUH_voLFAAI-mgACYFYgSPG1ancOmKUdOAQ",
                    },
                    {
                        "title": "Воссоединение",
                        "video": "BAACAgIAAxkBAAIOHmmDeK7piqLc1600o3Jz0X7d-tE1AAJDmgACYFYgSOyJE_bMyYvNOAQ",
                    },
                    {
                        "title": "Восторг",
                        "video": "BAACAgIAAxkBAAIOIGmDePkSbndCsnZGBySdfIzl2-IYAAJImgACYFYgSIWVvT1PAvicOAQ",
                    },
                    {
                        "title": "Передача (Выбор квами 1)",
                        "video": "BAACAgIAAxkBAAIOImmDeUXLuMA236GT7o86Bc2GQ3SRAAJPmgACYFYgSJOqs47MD5_iOAQ",
                    },
                    {
                        "title": "Сгорание (Выбор квами 2)",
                        "video": "BAACAgIAAxkBAAIOJGmDeZCZEgVRdBF1xLbV58NC_8xfAAJTmgACYFYgSPcXWVTNtzAeOAQ",
                    },
                    {
                        "title": "Совершенство",
                        "video": "BAACAgIAAxkBAAIOJmmDedkEuRtLWHdm_0axqPi42z-JAAJXmgACYFYgSCeNw9cUvWiXOAQ",
                    },
                    {
                        "title": "Перемещение",
                        "video": "BAACAgIAAxkBAAIOKGmDeiGJkOM4OOLSR1Tk7mmZwzINAAJgmgACYFYgSA4TAeW1qWvkOAQ",
                    },
                    {
                        "title": "Насмешка",
                        "video": "BAACAgIAAxkBAAIOKmmDemwxsPjH2e3iTKwxdGCqGwjTAAJqmgACYFYgSH9a_syNueSEOAQ",
                    },
                    {
                        "title": "Интуиция",
                        "video": "BAACAgIAAxkBAAIOLGmDerMaPsXWgGDSwEtiDvymoBm8AAJxmgACYFYgSO51f61Rz8x6OAQ",
                    },
                    {
                        "title": "Защита",
                        "video": "BAACAgIAAxkBAAIOLmmDev1ohWqqR04CEhB91G2XNkRzAAJ5mgACYFYgSE31-quYBNzQOAQ",
                    },
                    {
                        "title": "Обожание",
                        "video": "BAACAgIAAxkBAAIOMmmDe0lVyOfuQ2eKFlzbp7Wv0xv5AAKCmgACYFYgSIFozZcET36OOAQ",
                    },
                    {
                        "title": "Эмоция",
                        "video": "BAACAgIAAxkBAAIONGmDe5VPZZqP0DAJVAW4Bj_tvKJ_AAKWmgACYFYgSJDyW009jrueOAQ",
                    },
                    {
                        "title": "Притворство",
                        "video": "BAACAgIAAxkBAAIONmmDe-HFK8o9cQ2u9efiIaWOYjCbAAKjmgACYFYgSDlXv7GbdcnXOAQ",
                    },
                    {
                        "title": "Откровение",
                        "video": "BAACAgIAAxkBAAIOOGmDfC6oMexA842hKwceisQhw551AAKxmgACYFYgSJ5rjJ8Y5C3dOAQ",
                    },
                    {
                        "title": "Противостояние",
                        "video": "BAACAgIAAxkBAAIOOmmDfHrHTJCEizDgtHXsFSMHJBLwAAK6mgACYFYgSEV3-rNJHWMTOAQ",
                    },
                    {
                        "title": "Сговор",
                        "video": "BAACAgIAAxkBAAIOPmmDfMWSHh_EsIVELvP3uYVkgoURAALGmgACYFYgSGGLCgkdEjlAOAQ",
                    },
                    {
                        "title": "Революция",
                        "video": "BAACAgIAAxkBAAIOQGmDfRH66V5tbBA-iTFk8Zy8D5GQAALRmgACYFYgSEzM5jbLO48lOAQ",
                    },
                    {
                        "title": "Воплощение",
                        "video": "BAACAgIAAxkBAAIOQmmDfVzhYsG0AkUN9QjWHuuM-zv_AALmmgACYFYgSBbgan_Tzyj5OAQ",
                    },
                    {
                        "title": "Устройство (Последний день 1)",
                        "video": "BAACAgIAAxkBAAIORGmDfal8lcXmKB-pXkR2TVttydjXAAL2mgACYFYgSM-Kn9OisNZEOAQ",
                    },
                    {
                        "title": "Воссоздание (Последний день 2)",
                        "video": "BAACAgIAAxkBAAIORmmDffqKuWGXvuiieAIjfsO0TKuGAAIFmwACYFYgSKJOsy9cbygCOAQ",
                    },
                    {
                        "title": "Действие",
                        "video": "BAACAgIAAxkBAAIOSGmDfkFayiebLQQtsZ1KfrJ0p7Z3AAIWmwACYFYgSL-K_ENSM-DJOAQ",
                    },
                    
                ]
            },
            6: {
                "title" : "Сезон 6",
                "episodes": [
                    {
                        "title": "Королева Климата",
                        "video": "BAACAgIAAxkBAAIOY2mDo7qOCuu7mqOQgeeLuAgJBu8DAALRnwACYFYgSGgTZkRcDanKOAQ",
                    },
                    {
                        "title": "Визуализатор",
                        "video": "BAACAgIAAxkBAAIOZWmDpAficqgdX-bG4Z8b9K1TZVDBAALZnwACYFYgSGbTjDGfNmhrOAQ",
                    },
                    {
                        "title": "Сублимация",
                        "video": "BAACAgIAAxkBAAIOZ2mDpFIZLeVAplDs1tVHnllSNDb2AALlnwACYFYgSPjEcKW6uVmiOAQ",
                    },
                    {
                        "title": "Папакоп",
                        "video": "BAACAgIAAxkBAAIOa2mDpJv0eeAt375X22GskAwSaCNzAALtnwACYFYgSJOUo-dkpuvPOAQ",
                    },
                    {
                        "title": "Битва дедов",
                        "video": "BAACAgIAAxkBAAIObWmDpOb9Eib-vDvlR_0NMj5-Lgk0AAL2nwACYFYgSKqfGxBzF6ruOAQ",
                    },
                    {
                        "title": "Спящая Сирена",
                        "video": "BAACAgIAAxkBAAIOb2mDpURev-S0UboLVQphzVnVCqofAAL8nwACYFYgSFkya7hPzzw8OAQ",
                    },
                    {
                        "title": "Каменный Бык",
                        "video": "BAACAgIAAxkBAAIOcWmDpZEwpVkhvhF55d_SUBLy0BawAAIFoAACYFYgSP7OaHtVINMwOAQ",
                    },
                    {
                        "title": "Вампигами",
                        "video": "BAACAgIAAxkBAAIOc2mDpcUFJf4IJrE1XydzGuSoqpjoAAIQoAACYFYgSHlcZMrSY_NoOAQ",
                    },
                    {
                        "title": "Месье Агрест",
                        "video": "BAACAgIAAxkBAAIOdWmDpicLP06WQXOqyaEsZ1u-W-LHAAIZoAACYFYgSEWPlSLOSU2wOAQ",
                    },
                    {
                        "title": "Тёмный замок",
                        "video": "BAACAgIAAxkBAAIOd2mDpoIcMxtrlr5AuJCn98q2-UyoAAIjoAACYFYgSJg9ebpnHdk8OAQ",
                    },
                    {
                        "title": "Разоблачитель",
                        "video": "BAACAgIAAxkBAAIOeWmDptDWr-XsX6tUzJ_v2LLLalLfAAIooAACYFYgSHs2HrEzBfEwOAQ",
                    },
                    {
                        "title": "Исцелитель",
                        "video": "BAACAgIAAxkBAAIOgmmDpygbCdx3azauZ7iMP2UKB6HcAAIroAACYFYgSPMSVSbUUEr1OAQ",
                    },
                    {
                        "title": "Якши Годзен",
                        "video": "BAACAgIAAxkBAAIOhGmDp4Cg8KXxbFujZSaw74oAAcOvtwACMaAAAmBWIEhhUSFoOAgx5zgE",
                    },
                    {
                        "title": "Памперсайзер",
                        "video": "BAACAgIAAxkBAAIOimmDrHWnyFlt6ce2OFiTelYYIj4PAAJ7oAACYFYgSK_FltJ2guuOOAQ",
                    },
                    {
                        "title": "Властитель",
                        "video": "BAACAgIAAxkBAAIOhmmDp8d9IEnHeYmDVktDXIipGIx4AAI2oAACYFYgSJ8VfAzlxAXROAQ",
                    },
                    {
                        "title": "Ноэ",
                        "video": "BAACAgIAAxkBAAISdWmIirLYBqHjWEID41AOon8azHtIAAIdnAACiudJSNONfNKAE2PdOgQ",
                    },
                    
                ]
            },
            7: {
                "title" : "Спец Эпизоды",
                "episodes": [
                    {
                        "title": "Нью-Йорк",
                        "video": "BAACAgIAAxkBAAIOm2mDuMKYTTruUFWnYCq8E-sv8mQLAALmoAACYFYgSLRiaHwOIDJgOAQ",
                    },
                    {
                        "title": "Шанхай",
                        "video": "BAACAgIAAxkBAAIOnWmDuXfKlTvnRynguB2kufXtGXOyAALtoAACYFYgSI_G4uSJjfkjOAQ",
                    },
                    {
                        "title": "Париж",
                        "video": "BAACAgIAAxkBAAIOn2mDuhGojIQ4JLVMAg0ii7SRzIKxAALzoAACYFYgSNt5ncolSWeBOAQ",
                    },
                    {
                        "title": "Лондон",
                        "video": "BAACAgIAAxkBAAIOoWmDutUgZaoDbCuFnaIcPMGqLOJVAAL6oAACYFYgSLQCUkt9sHmtOAQ",
                    },
                ]
            },
        }
    },
    "081": {
        "title": "Ванда/Вижн",
        "year": 2021,
        "episode_counter": "9 серий",
        "description": "Ванда и Вижн — молодожены, живущие в идиллическом городке Вествью. Поначалу жизнь героев кажется им идеальной, но постепенно они понимают, что это не так.",
        "poster": "AgACAgIAAxkBAAIUSmmLYgfU0c8GmV4rynRyyGfMru6sAAKxGGsbUAhZSP87ZnaE3l1JAQADAgADeQADOgQ",
        "country": "США",
        "director": "Мэтт Шекман",
        "genres": ["фантастика", "боевик", "драма", "мелодрама"],
        "seasons": {
            1: {
                "title" : "Сезон 1",
                "episodes": [
                    {
                        "video": "BAACAgIAAxkBAAIUTGmLYqJSXdRi4ub1xXMV36bF-t6yAAJknwACUAhZSPDnoTo1GWSgOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIUTmmLYuCkN2w-vnhizBy9mOvCfUBOAAJmnwACUAhZSDyoO47817srOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIUUGmLYxPFXSnEjHEV1ZFhdxkvZqVYAAJpnwACUAhZSHZdcJgWzpQeOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIUUmmLY0sxgKRhybxuPgR7j2XAdyqQAAJunwACUAhZSEf44SH1hcMzOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIUVGmLY41IHeDGv9-jsTHYU8MooWa9AAJxnwACUAhZSIEs1Iams5pwOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIUVmmLY8tCb5gl37OkG5aiJum-_fMGAAJ5nwACUAhZSOq6Yk_rrqtaOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIUWGmLZAk1PerF_FV3BtE-IiJKMxYpAAKCnwACUAhZSPrvKYM_4YkpOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIUWmmLZFUxImrOnP-Do9vR_3idC8NqAAKLnwACUAhZSN1myU5jQ6BwOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIUXGmLZKqrmr1RUY-IBSEfEJYc3yiEAAKVnwACUAhZSHvlhSNCM4CqOgQ",
                    },
                    
                ]
            },
        }
    },   
    "082": {
        "title": "Локи",
        "year": 2021,
        "episode_counter": "12 серий",
        "description": "Локи попадает в таинственную организацию «Управление временными изменениями» после того, как он украл Тессеракт, и путешествует во времени, меняя историю.",
        "poster": "AgACAgIAAxkBAAIURGmLV01DzsI_DBMTYaLp3u5HDbR8AAIwGGsbUAhZSCe1xQl7AopeAQADAgADeQADOgQ",
        "country": "США",
        "director": "Джастин Бенсон",
        "genres": ["фантастика", "боевик"],
        "seasons": {
            1: {
                "title" : "Сезон 1",
                "episodes": [
                    {
                        "video": "BAACAgIAAxkBAAIULGmLURI3LK7SQIJu46VMlun0DxWvAAI1ngACUAhZSFn4zTMsmHHcOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIULmmLUYSZBJB0PUwBjPtW0HIPLK9bAAI6ngACUAhZSODsqMc_7IsuOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIUMGmLUdbLWGDLoU5e89VKptyF26qLAAI-ngACUAhZSMma3FUYrCLfOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIUMmmLUjDyWZvSGchxioJ5wYThgpK3AAJJngACUAhZSOmfxSGCUdPEOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIUNGmLUo53F0Zhff9S9IgnG0KtI1DPAAJNngACUAhZSLN9EGa2ZNCHOgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIUNmmLUuT5OdJl8U1JoSgw_CN5zC-JAAJWngACUAhZSEzqtSbmxFPfOgQ",
                    },
                    
                ]
            },
            2: {
                "title" : "Сезон 2",
                "episodes": [
                    {
                        "video": "BAACAgIAAxkBAAIUOGmLUzZ09zXuneiHM1ZPwtZPqR7VAAJZngACUAhZSHUBfRmYAAFLTDoE",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIUOmmLU5cMDuY5SOtpug6pnOpkz355AAJfngACUAhZSLkCqfj57li8OgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIUPGmLU_qgoIq8udT14Lnm4ZXfC8dqAAJmngACUAhZSJQ5XPpTu9y1OgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIUPmmLVEfCyWoAAeN5WelzUX3-eZzsugACbJ4AAlAIWUhox0F8LCLSxzoE",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIUQGmLVJtc8a-ZpQcLZoJgifG8pS7XAAJvngACUAhZSO6YJ1-r4Ja8OgQ",
                    },
                    {
                        "video": "BAACAgIAAxkBAAIUQmmLVQOhojpgDfFQnsvHSGzc74NOAAJ0ngACUAhZSGlvQ078zkoNOgQ",
                    },
                    
                ]
            },
        }
    },
    "090": {
        "title": "Скажи, что ты видела",
        "year": 2020,
        "episode_counter": "16 серий",
        "description": "После взрыва, устроенного маньяком и унесшего жизнь его невесты, криминальный профайлер уехал в сельскую глушь подальше от людей. Там он знакомится с местной начинающей полицейской, у которой есть способность помнить всё, что она когда-либо видела.",
        "poster": "AgACAgIAAxkBAAIO52mEdtl6DOA7Q1UbZdbCF_ijYzvtAAI3D2sb24kpSNXfkkNE1shKAQADAgADeQADOAQ",
        "country": "Южная Корея",
        "director": "Ли Джун-хён",
        "genres": ["дорама", "триллер", "детектив", "криминал"],
        "episodes": [
            {
                "video": "BAACAgIAAxkBAAIOx2mEcQ7FqaHk6UhBUNb99GnfxaizAAKkhwAC24kpSATtDrROujXnOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIOyWmEcS07CYnFmQsfH8Yplq4MpQYsAAKlhwAC24kpSLuFAzJaDIZUOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIOy2mEcU5SobysyWBgYnroV6uloE8TAAKohwAC24kpSHZI6pBVDr6aOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIOzWmEcW-w620XVpmWP7CX9iGH5EQXAAKphwAC24kpSBLmFb5Ah-FVOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIOz2mEcY7JZ8UAAeNPpaDNLZvLDY8RIwACqocAAtuJKUjbtZlD-ITo6DgE",
            },
            {
                "video": "BAACAgIAAxkBAAIO0WmEca8MAlMwNe8BHBOfiG8Jo6NiAAKwhwAC24kpSJn_QpufnS5hOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIO02mEcdLcHjfyCJ2gv8Vv1z8qOvKzAAK2hwAC24kpSFF458aiAq9KOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIO1WmEcfOaqvweMAnYrjvBVaUg7s0zAAK8hwAC24kpSDc5J4XQQDCZOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIO12mEchG-h6c5eeiH3wMCRI6UEvPzAALAhwAC24kpSHKzL6mG5rZXOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIO2WmEcjMcT3YSzKT-oGQ0aw5BwlHxAALHhwAC24kpSOgwVLHKFh37OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIO22mEclnIEAtdUG3yqxIF2WYuTGYCAALJhwAC24kpSEdOK_m0W0zXOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIO3WmEcnrwCsSpY0K3FAZWEDuPlI7wAALMhwAC24kpSPKHFwen0LspOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIO32mEcppmdDCTWBz806-JKHDwPlAzAALQhwAC24kpSAbkRbrsYqd4OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIO4WmEcrT6seQQ3kPb-Pye3pHw-p4OAALVhwAC24kpSL1wdsFiXo26OAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIO42mEctQlrdGpX2CO7ovm77wUfgLUAALahwAC24kpSD5Nd1aE0RGBOAQ",
            },
            {
                "video": "BAACAgIAAxkBAAIO5WmEcvLffQTwOrf4txFlvpN8raCyAALbhwAC24kpSHqCUAccqWO8OAQ",
            },
            
        ]
    },
}

def subscribe_keyboard_movie(code: str):
    return InlineKeyboardMarkup(inline_keyboard=[
        [InlineKeyboardButton(text="📍 Подписаться", url="https://t.me/kinonawe4er")],
        [InlineKeyboardButton(
            text="🔎 Проверить",
            callback_data=f"check_movie:{code}"
        )]
    ])

def seasons_keyboard(code: str):
    serial = series[code]
    keyboard = []

    for season_num in sorted(serial["seasons"].keys()):
        season_data = serial["seasons"][season_num]
        season_title = season_data.get("title")

        if season_title:
            text = f"{season_title}"
        else:
            text = f"Сезон {season_num}"

        keyboard.append([
            InlineKeyboardButton(
                text=text,
                callback_data=f"season:{code}:{season_num}"
            )
        ])

    keyboard.append([
        InlineKeyboardButton(
            text="⬅️ Назад",
            callback_data=f"serial:{code}"
        )
    ])

    return InlineKeyboardMarkup(inline_keyboard=keyboard)


@dp.callback_query(lambda c: c.data.startswith("seasons:"))
async def seasons_menu(callback: types.CallbackQuery):
    _, code = callback.data.split(":")

    await callback.message.edit_reply_markup(
        reply_markup=seasons_keyboard(code)
    )

    await callback.answer()

@dp.callback_query(lambda c: c.data.startswith("season:"))
async def season_selected(callback: types.CallbackQuery):
    _, code, season = callback.data.split(":")
    season = int(season)

    await callback.message.edit_reply_markup(
        reply_markup=series_menu_keyboard(code, page=0, season=season)
    )

    await callback.answer()


def has_only_warning(item: dict) -> bool:
    return "warning" in item and len(item.keys()) == 1

def normalize(text: str) -> str:
    text = text.lower().replace("ё", "е")
    text = re.sub(r"[^\w\s]", "", text)  # удаляет знаки препинания
    text = text.replace(" ", "")
    return text

def has_seasons(serial: dict) -> bool:
    return "seasons" in serial


def get_episodes(serial: dict, season: int | None = None):
    if has_seasons(serial):
        if season is None:
            season = min(serial["seasons"].keys())
        return serial["seasons"][season]["episodes"]
    else:
        return serial["episodes"]

def search_movies(query: str):
    query = normalize(query.strip())
    results = []

    for code, movie in movies.items():
        title = normalize(movie.get("title", ""))
        if query in title:
            results.append(("movie", code, movie))

    return results

def search_series(query: str):
    query = normalize(query.strip())
    results = []

    for code, serial in series.items():
        title = normalize(serial.get("title", ""))
        if query in title:
            results.append(("series", code, serial))

    return results

def search_by_code(query: str):
    query = query.strip().lower()

    if query in movies:
        return [("movie", query, movies[query])]

    if query in series:
        return [("series", query, series[query])]

    return []

def search_by_title(query: str):
    query = normalize(query)
    results = []

    for code, movie in movies.items():
        if query in normalize(movie.get("title", "")):
            results.append(("movie", code, movie))

    for code, serial in series.items():
        if query in normalize(serial.get("title", "")):
            results.append(("series", code, serial))

    return results

def search_all(query: str):
    by_code = search_by_code(query)
    if by_code:
        return by_code

    return search_by_title(query)


def search_results_keyboard(results):
    keyboard = []

    for item_type, code, item in results:
        emoji = "🎬" if item_type == "movie" else "📺"
        keyboard.append([
            InlineKeyboardButton(
                text=f"{emoji} {item['title']}",
                callback_data=f"open:{item_type}:{code}"
            )
        ])

    return InlineKeyboardMarkup(inline_keyboard=keyboard)




ITEMS_PER_PAGE = 6

# --- Получаем все жанры ---
def get_all_genres():
    genres = set()
    for movie in movies.values():
        genres.update(movie.get("genres", []))
    for serial in series.values():
        genres.update(serial.get("genres", []))
    return sorted(genres)


# --- Кнопки для жанров ---
def genres_keyboard():
    keyboard = []
    for genre in get_all_genres():
        keyboard.append([
            InlineKeyboardButton(
                text=genre.capitalize(),
                callback_data=f"genre:{genre}"
            )
        ])
    return InlineKeyboardMarkup(inline_keyboard=keyboard)


# --- Фильтруем по жанру ---

def find_by_genre(genre: str):
    results = []

    for code, movie in movies.items():
        if genre in movie.get("genres", []):
            results.append(("movie", code, movie))

    for code, serial in series.items():
        if genre in serial.get("genres", []):
            results.append(("series", code, serial))

    return results

# --- Получаем страницу ---
def genre_page(genre: str, page: int):
    items = find_by_genre(genre)
    total_pages = (len(items) + ITEMS_PER_PAGE - 1) // ITEMS_PER_PAGE
    start = page * ITEMS_PER_PAGE
    end = start + ITEMS_PER_PAGE
    return items[start:end], total_pages


# --- Кнопки фильмов/сериалов с пагинацией ---
def genre_keyboard(genre: str, page: int, total_pages: int, items):
    keyboard = []

    for item_type, code, item in items:
        emoji = "🎬" if item_type == "movie" else "📺"
        keyboard.append([
            InlineKeyboardButton(
                text=f"{emoji} {item['title']}",
                callback_data=f"open:{item_type}:{code}"
            )
        ])

    nav = []
    if page > 0:
        nav.append(InlineKeyboardButton(text="⬅️", callback_data=f"genre_page:{genre}:{page-1}"))
    nav.append(InlineKeyboardButton(text=f"{page+1}/{total_pages}", callback_data="noop"))
    if page < total_pages - 1:
        nav.append(InlineKeyboardButton(text="➡️", callback_data=f"genre_page:{genre}:{page+1}"))

    keyboard.append(nav)
    return InlineKeyboardMarkup(inline_keyboard=keyboard)


# --- Хендлер нажатия на жанр ---
@dp.callback_query(lambda c: c.data.startswith("genre:"))
async def genre_selected(callback: types.CallbackQuery):
    genre = callback.data.split(":")[1]
    items, total_pages = genre_page(genre, 0)

    if not items:
        await callback.message.answer(f"<b>❌ Ничего не найдено\n\n@kinonawe4er - все наши фильмы и сериалы</b>\n\n<b>/genres - сортировка по жанрам</b>",
        parse_mode="HTML")
        await callback.answer()
        return

    await callback.message.edit_text(
        f"<b>🎭 Жанр: {genre.capitalize()}</b>",
        reply_markup=genre_keyboard(genre, 0, total_pages, items),
        parse_mode="HTML"
    )
    await callback.answer()


# --- Хендлер переключения страниц жанра ---
@dp.callback_query(lambda c: c.data.startswith("genre_page:"))
async def genre_page_switch(callback: types.CallbackQuery):
    _, genre, page = callback.data.split(":")
    page = int(page)
    items, total_pages = genre_page(genre, page)

    await callback.message.edit_reply_markup(
        reply_markup=genre_keyboard(genre, page, total_pages, items)
    )
    await callback.answer()


# --- Хендлер открытия фильма/сериала по кнопке ---
@dp.callback_query(lambda c: c.data.startswith("open:"))
async def open_item(callback: types.CallbackQuery):
    _, item_type, code = callback.data.split(":")
    user_id = callback.from_user.id
    
    if item_type == "movie":
        if not await is_subscribed(user_id):
            await callback.message.answer(
                "Для просмотра фильма подпишитесь на канал @kinonawe4er",
                reply_markup=subscribe_keyboard_movie(code)
            )
            await callback.answer()
            return
        movie = movies[code]  # создаем movie первым!

        if has_only_warning(movie):
            await callback.message.answer(
                f"<b>{movie['warning']}</b>",
                parse_mode="HTML"
            )
            await callback.answer()
            return

        hashtags = " ".join(f"#{g.replace(' ', '_')}" for g in movie.get('genres', []))
        
        await callback.message.answer_video(
            video=movie["video"],
            caption=(
                f"<b>⭐️ фильм «{movie['title']}», {movie['year']}</b>\n\n"
                f"<i>{movie.get('description', '')}</i>\n\n"
                f"<u>Жанр:</u> {hashtags}\n\n"
                f"<u>Страна:</u> {movie.get('country', '')}\n"
                f"<u>Режиссер:</u> {movie.get('director', '')}\n\n"
                f"Смотреть бесплатно фильмы и сериалы 👉🏻 @kinonawe4er_bot\n"
                f"Наш канал @kinonawe4er ✨"
            ),
            parse_mode="HTML"
        )
    else:  # сериал
        await send_serial_card(callback.message, code)
    
    await callback.answer()

@dp.callback_query(lambda c: c.data.startswith("check_movie:"))
async def check_movie_callback(callback: types.CallbackQuery):
    _, code = callback.data.split(":")
    user_id = callback.from_user.id

    if not await is_subscribed(user_id):
        await callback.answer("❌ Вы ещё не подписались", show_alert=True)
        return

    movie = movies.get(code)
    if not movie:
        await callback.answer("❌ Фильм не найден", show_alert=True)
        return

    if has_only_warning(movie):
        await callback.message.answer(
            f"<b>{movie['warning']}</b>",
            parse_mode="HTML"
        )
        return

    hashtags = " ".join(f"#{g.replace(' ', '_')}" for g in movie.get("genres", []))

    await callback.message.answer_video(
        video=movie["video"],
        caption=(
            f"<b>⭐️ фильм «{movie['title']}», {movie['year']}</b>\n\n"
            f"<i>{movie.get('description', '')}</i>\n\n"
            f"<u>Жанр:</u> {hashtags}\n\n"
            f"<u>Страна:</u> {movie.get('country', '')}\n"
            f"<u>Режиссер:</u> {movie.get('director', '')}\n\n"
            f"Смотреть бесплатно фильмы и сериалы 👉🏻 @kinonawe4er_bot\n"
            f"Наш канал @kinonawe4er ✨"
        ),
        parse_mode="HTML"
    )

    await callback.answer("✅ Подписка подтверждена")


def serial_start_keyboard(code: str):
    serial = series[code]

    if has_seasons(serial):
        return InlineKeyboardMarkup(
            inline_keyboard=[[
                InlineKeyboardButton(
                    text="📂 ВЫБРАТЬ СЕЗОН",
                    callback_data=f"seasons:{code}"
                )
            ]]
        )
    else:
        return InlineKeyboardMarkup(
            inline_keyboard=[[
                InlineKeyboardButton(
                    text="📋 ВЫБРАТЬ СЕРИЮ",
                    callback_data=f"menu:{code}:0"
                )
            ]]
        )


async def send_serial_card(message: types.Message, code: str):
    serial = series[code]
    hashtags = " ".join(f"#{g.replace(' ', '_')}" for g in serial.get("genres", []))
    text = (
        f"<b>⭐️ «{serial['title']}», {serial['year']}, ({serial['episode_counter']})</b>\n\n"
        f"<i>{serial['description']}</i>\n\n"
        f"<u>Жанр:</u> {hashtags}\n\n"
        f"<u>Страна:</u> {serial['country']}\n"
        f"<u>Режиссер:</u> {serial['director']}\n\n"
    )

    await message.answer_photo(
        photo=serial["poster"],
        caption=text,
        parse_mode="HTML",
        reply_markup=serial_start_keyboard(code)
    )


def episode_keyboard(code: str, episode_index: int, total: int, season: int | None = None):
    serial = series[code]

    # Верхний ряд — кнопки «Выбрать серию» и «К сезонам» (если есть)
    top_row = []

    if has_seasons(serial) and season is not None:
        top_row.append(
            InlineKeyboardButton(
                text="📂 К сезонам",
                callback_data=f"seasons:{code}"
            )
        )

    top_row.append(
        InlineKeyboardButton(
            text="📋 ВЫБРАТЬ СЕРИЮ",
            callback_data=f"menu:{code}:{season if season is not None else -1}"
        )
    )

    # Нижний ряд — кнопки навигации вперед/назад
    nav_row = []
    if episode_index > 0:
        nav_row.append(
            InlineKeyboardButton(
                text="⬅️",
                callback_data=f"prev:{code}:{season if season is not None else -1}:{episode_index}"
            )
        )
    if episode_index < total - 1:
        nav_row.append(
            InlineKeyboardButton(
                text="➡️",
                callback_data=f"next:{code}:{season if season is not None else -1}:{episode_index}"
            )
        )

    # Формируем клавиатуру с двумя рядами
    keyboard = [top_row]
    if nav_row:
        keyboard.append(nav_row)

    return InlineKeyboardMarkup(inline_keyboard=keyboard)








def series_menu_keyboard(code: str, page: int = 0, season: int | None = None):
    serial = series[code]
    episodes = get_episodes(serial, season)
    total = len(episodes)

    per_page = 10
    start = page * per_page
    end = min(start + per_page, total)

    keyboard = []
    row = []

    # --- КНОПКИ СЕРИЙ ---
    for i in range(start, end):
        row.append(
            InlineKeyboardButton(
                text=str(i + 1),
                callback_data=f"ep:{code}:{season if season is not None else 0}:{i}"
            )
        )

        if len(row) == 5:  # 5 в ряд
            keyboard.append(row)
            row = []

    if row:
        keyboard.append(row)

    # --- ПАГИНАЦИЯ ---
    nav = []

    if page > 0:
        nav.append(
            InlineKeyboardButton(
                text="⬅️",
                callback_data=f"page:{code}:{season if season is not None else 0}:{page-1}"
            )
        )

    if end < total:
        nav.append(
            InlineKeyboardButton(
                text="➡️",
                callback_data=f"page:{code}:{season if season is not None else 0}:{page+1}"
            )
        )

    if nav:
        keyboard.append(nav)

    # --- КНОПКИ ВОЗВРАТА ---
    back_buttons = []

    # если есть сезоны → к сезонам
    if "seasons" in serial:
        back_buttons.append(
            InlineKeyboardButton(
                text="📀 К сезонам",
                callback_data=f"seasons:{code}"
            )
        )

    # назад к сериалу
    back_buttons.append(
        InlineKeyboardButton(
            text="К сериалу",
            callback_data=f"serial:{code}"
        )
    )

    # добавляем внизу
    keyboard.append(back_buttons)

    return InlineKeyboardMarkup(inline_keyboard=keyboard)




async def send_episode(
    target,
    code: str,
    episode_index: int,
    season: int | None = None
):
    user_id = target.from_user.id if isinstance(target, types.CallbackQuery) else target.chat.id

    if not await is_subscribed(user_id):
        keyboard = InlineKeyboardMarkup(inline_keyboard=[
            [InlineKeyboardButton(text="📍 Подписаться", url="https://t.me/kinonawe4er")],
            [InlineKeyboardButton(
                text="🔎 Проверить",
                callback_data=f"check_sub:{code}:{episode_index}"
            )]
        ])

        await target.message.answer(
            "Для просмотра серии подпишитесь на канал @kinonawe4er",
            reply_markup=keyboard
        )
        return

    serial = series[code]
    episodes = get_episodes(serial, season)
    total = len(episodes)
    episode = episodes[episode_index]
    episode_title = episode.get("title")

    # ---- Название сезона ----
    season_text = ""
    if has_seasons(serial) and season is not None:
        season_title = serial["seasons"][season].get("title")
        if season_title:
            season_text = f"{season_title}, "
        else:
            season_text = f"Сезон {season}, "

    if episode_title:
        episode_line = f"{season_text}серия {episode_index + 1} из {total} «{episode_title}»"
    else:
        episode_line = f"{season_text}серия {episode_index + 1} из {total}"

    caption = (
        f"<b>⭐️ «{serial['title']}», {serial['year']}, ({serial['episode_counter']})</b>\n\n"
        f"{episode_line}\n\n"
        f"Смотреть бесплатно фильмы и сериалы 👉🏻 @kinonawe4er_bot\n"
        f"Наш канал @kinonawe4er ✨"
    )

    keyboard = episode_keyboard(code, episode_index, total, season)

    if isinstance(target, types.CallbackQuery):
        await target.message.edit_media(
            media=types.InputMediaVideo(
                media=episode["video"],
                caption=caption,
                parse_mode="HTML"
            ),
            reply_markup=keyboard
        )
    else:
        await target.answer_video(
            video=episode["video"],
            caption=caption,
            parse_mode="HTML",
            reply_markup=keyboard
        )


@dp.callback_query(lambda c: c.data.startswith("check_sub:"))
async def check_sub_callback(callback: types.CallbackQuery):
    _, code, episode = callback.data.split(":")
    await send_episode(callback, code, int(episode))


# Функция для поиска фильма по коду или названию
def find_movie(query: str):
    query = normalize(query.strip())

    # Сначала ищем по коду
    for code, movie in movies.items():
        if query == code.lower():
            return movie

    # Потом ищем по названию
    for movie in movies.values():
        title = normalize(movie.get("title", ""))
        if query in title:
            return movie

    return None

def find_series(query: str):
    query = normalize(query.strip())

    for code, serial in series.items():

        if query == str(code).lower():
            return code

        title = normalize(serial.get("title", ""))
        if query in title:
            return code

    return None

@dp.message(Command("start"))
async def cmd_start(message: types.Message):
    add_or_update_user(message.from_user)
    await message.answer(
        "<b>Для просмотра введите название ИЛИ код</b>\n\n"
        "<b>Например: «Фокус» ИЛИ же его код «001»</b>\n\n"
        "<b>https://t.me/kinonawe4er - наш канал ✨</b>\n\n"
        "<b>/genres - сортировка по жанрам</b>",
        parse_mode="HTML",
        disable_web_page_preview=True
    )

@dp.message(Command("genres"))
async def cmd_genres(message: types.Message):
    add_or_update_user(message.from_user)
    await message.answer(
        "<b>🎭 Выберите жанр:</b>",
        reply_markup=genres_keyboard(),
        parse_mode="HTML"
    )

# # Основной хендлер сообщений

@dp.message(lambda m: m.video and m.from_user.id == ADMIN_ID)
async def get_video_id(message: types.Message):
    await message.answer(message.video.file_id)


@dp.message(lambda m: m.photo and m.from_user.id == ADMIN_ID)
async def get_photo_id(message: types.Message):
    await message.answer(message.photo[-1].file_id)

@dp.message(lambda m: m.text)
async def handle_message(message: types.Message):
    query = message.text.strip().lower()  # приведение к нижнему регистру

    add_or_update_user(message.from_user)

    results = search_all(query)

    if not results:
        await message.answer(f"<b>❌ Ничего не найдено\n\n@kinonawe4er - все наши фильмы и сериалы</b>\n\n<b>/genres - сортировка по жанрам</b>",
        parse_mode="HTML")
        return

    # один результат — открываем сразу
    if len(results) == 1:
        item_type, code, _ = results[0]

        if item_type == "movie":
            if not await is_subscribed(message.from_user.id):
                await message.answer(
                    "Для просмотра фильма подпишитесь на канал @kinonawe4er",
                        reply_markup=subscribe_keyboard_movie(code)
                )
                return
            movie = movies[code]

            if has_only_warning(movie):
                await message.answer(
                    f"<b>{movie['warning']}</b>",
                    parse_mode="HTML"
                )
                return

            hashtags = " ".join(f"#{g.replace(' ', '_')}" for g in movie.get("genres", []))

            await message.answer_video(
                video=movie["video"],
                caption=f"<b>⭐️ фильм «{movie['title']}», {movie['year']}</b>\n\n"
                        f"<i>{movie['description']}</i>\n\n"
                        f"<u>Жанр:</u> {hashtags}\n\n"
                        f"<u>Страна:</u> {movie['country']}\n"
                        f"<u>Режиссер:</u> {movie['director']}\n\n"
                        f"Смотреть бесплатно фильмы и сериалы 👉🏻 @kinonawe4er_bot\n"
                        f"Наш канал @kinonawe4er ✨",
                parse_mode="HTML"
            )
        else:
            await send_serial_card(message, code)

        return

    # несколько результатов — выбор
    await message.answer(
        "<b>🔍 Найдено несколько вариантов:</b>",
        reply_markup=search_results_keyboard(results),
        parse_mode="HTML"
    )
    



@dp.callback_query()
async def handle_callbacks(callback: types.CallbackQuery):
    data = callback.data.split(":")
    action = data[0]

    if action in ("menu", "prev", "next", "ep", "page"):
        code = data[1]

        # Для всех этих действий берем сезон
        season = None
        if len(data) > 2:
            s = data[2]
            if s not in ("None", "-1"):
                season = int(s)

        # В зависимости от действия
        if action == "menu":
            await callback.message.edit_reply_markup(
                reply_markup=series_menu_keyboard(code, page=0, season=season)
            )

        elif action in ("prev", "next"):
            episode = int(data[3])
            episode = episode - 1 if action == "prev" else episode + 1
            await send_episode(callback, code, episode, season)

        elif action == "ep":
            episode = int(data[3])
            await send_episode(callback, code, episode, season)

        elif action == "page":
            page = int(data[3])
            await callback.message.edit_reply_markup(
                reply_markup=series_menu_keyboard(code, page=page, season=season)
            )

    elif action == "serial":
        _, code = data
        await callback.message.delete()
        await send_serial_card(callback.message, code)

    elif action == "seasons":
        _, code = data
        await callback.message.edit_reply_markup(
            reply_markup=seasons_keyboard(code)
        )

    elif action == "season":
        _, code, season = data
        season = int(season)
        await callback.message.edit_reply_markup(
            reply_markup=series_menu_keyboard(code, page=0, season=season)
        )

    await callback.answer()


# Запуск бота
async def main():
    await dp.start_polling(bot)

if __name__ == "__main__":
    asyncio.run(main())